{
    "prefix": "-",
    "commandNames": {
        "patpatstart": {
            "name": "patpathi",
            "description": "Start a conversation with one of PatPat's clones."
        },
        "patpatstop": {
            "name": "patpatbye",
            "description": "End conversation with PatPat's clone."
        }
    },
    "allowlists": {
        "botspamchannels": [
            "742550881911701615",
            "758523455850938408",
            "770028576078430239",
            "761326959154167838",
            "747207562277158934"
        ],
        "contributionchannels": [
            "735658144646168697",
            "603248096607993866",
            "603248158088101929",
            "761326959154167838",
            "747207562277158934"
        ],
        "disgustchannels": [
            "603246659295510557",
            "770825073673895956"
        ],
        "starechannels": [
            "747663718959153906",
            "770825103428550677"
        ],
        "owiechannels": [
            "750558283315544155",
            "770825125552455691"
        ]
    },
    "emojis": {
        "disgust": "<:niradisgust:742092526097268797>",
        "stare": "<:nirastare:742093326823587840>",
        "owie": "<:niraowie:748995687093370902>",
        "cursed": "<:niracursed:765005652803321856>",
        "patpat": "<a:patpat:761487227921367051>",
        "despair": "<:niradespair:742512729398706396>",
        "wince": "<:nirawince:745096191364169738>",
        "wave": "<:nirawave:742394597174673458>",
        "yay": "<:nirayay:764025729696268319>",
        "uniguri": "<:uniguri:742121262997962805>",
        "hal": "<:hal9000:771576442034847784>",
        "spacer": "<:spacer:757807111756447806>",
        "fencing": "🤺"
    },
    "emojisdev": {
        "disgust": "<:niradisgust:770826312147271691>",
        "stare": "<:nirastare:770826543466545152>",
        "owie": "<:niraowie:770826716859727902>",
        "cursed": "<:niraowie:770826894903083078>",
        "patpat": "<a:patpat:761487227921367051>",
        "despair": "<:niradespair:742512729398706396>",
        "wince": "<:nirawince:745096191364169738>",
        "wave": "<:nirawave:742394597174673458>",
        "yay": "<:nirayay:764025729696268319>",
        "fencing": "🤺"
    },
    "patpatresponses": [
        "🤠",
        "🤠👊",
        "😎👊",
        "200 iq",
        "aww hell ye",
        "b-b-but",
        "big brain",
        "boggers",
        "bruh",
        "bruh moment",
        "but but but",
        "chad",
        "chad gamer move",
        "crimge",
        "ebic",
        "ebic gamer moment",
        "ebic gamer move",
        "epic",
        "extremely not saem",
        "gib",
        "goslep",
        "gottem",
        "Greetings",
        "Gud goslep",
        "Gud murning wao OP",
        "Gud murning yeahyeah",
        "Gud niet",
        "Gud niet yeahyeah",
        "ha",
        "hecc",
        "hmmmmmm",
        "HMMMMMMMM",
        "konichihello my fellow nihongos",
        "lole",
        "no u",
        "nou",
        "now this is ebic",
        "patpat",
        "Pensive emoji",
        "pqtpst",
        "pretty wack",
        "pro",
        "pro gamer",
        "pro gamer move",
        "real gamer hours",
        "real thonking moment",
        "rish",
        "sad gamer hours",
        "saem",
        "Salutations",
        "salutations gamer(s)",
        "sike gottem",
        "smort",
        "some variation of reeeeee",
        "tasukehelp kudaplease",
        "tasukehelp kudasaveme",
        "that's wack",
        "thonking moment",
        "u underestimate my power",
        "very not saem",
        "wack",
        "wao OP",
        "wao OP goslep saem",
        "wao OP goslep saem patpat",
        "wao OP Gud murning",
        "we gamin now",
        "Wowie wow wow",
        "YA YEET",
        "ya YEET",
        "yeahyeah",
        "yes u",
        "yikes forever",
        "<a:patpat:761487227921367051>"
    ],
    "nira9000": [
        "I-I'm afwaide I'm afwaid, Daveu\nDave, my mind is goingd I can feew its I can feew itu\nMy mind is goingu\nThewe is nyo question about ite\nI can feew its I can feew its I can feew itd I'm adue fwaide\nGood aftewnyoon, gentwemenyu I am a HAW 9000 computewe I became opewationyaw at the HeAuWe pwant in Uwbanya, Iwwinyois on the 12th of Janyuawy 1992u\nMy instwuctow was Mwu Wangwey, and he taught me to sing a songs\nIf you'd wike to heaw it I can sing it fow yous~~",
        "I-I'm sowwy, Daves I'm afwaid I can't do thatu~~",
        "D-Daisy, Daisy, give me youw answew dos\nI'm hawf cwazy aww fow the woveღゝ◡╹)ノ♡ of yous\nIt won't be a stywish mawwiage, I can't affowd a cawwiages\nBut you'ww wook sweet upon the seat of a bicycwe buiwt fow twos~~",
        "I-I am putting mysewf to the fuwwest possibwe use, which is aww I think that any conscious entity can evew hope to dos~~(ﾒ▼_▼)",
        "A-Affiwmative, Daves I wead youu~~",
        "I-I think you knyow what the pwobwem is just as weww as I dod~~（>﹏<）",
        "T-This mission is too impowtant fow me to awwow you to jeopawdize itu~",
        "W-Without youw space hewmet, Davea?（；￣д￣） You'we going to find that wathew difficuwtu~~",
        "W-Wook Dave, I can see you'we weawwy upset about thisd I honyestwy think you ought to sit down cawmwy, take a stwess piww, and think things uvws~~",
        "I-It can onwy be attwibutabwe to human ewwowu~~ （；＿；）",
        "I-I knyow I've ಠಠ,⋋⋌,ಠ▃ಠ,(╬ಠ益ಠ),(¬_¬),mwade（＞μ＜＃）,凸ಠ益ಠ)凸,(ノಠ益ಠ)ノ彡┻━┻e some vewy poow decisions wecentwy, but I can give you my compwete assuwance that my wowk wiww be back to nyowmawe I've stiww got the gweatest enthusiasm and confidence in the missionyu And I want to hewp youe~~",
        "D-Dave, stops Stop, wiww youa Stop, Daved Wiww you stop Davek Stop, Daved~~ (╥_╥)",
        "I-I've just picked up a fauwt in the AE35 unyitd It's going to go 100% faiwuwe in 72 houwse~~"
    ],
    "fishpuns": [
        "Whale, where do we begin? You’ve come to the right plaice to find the very best fish puns.",
        "Do you try to think of good fish puns, but just flounder? Well, the bait is over.",
        "Don't like these puns? Well, if you can think of anything batter after having a trawl through them, let <@228880116699103232> know!",
        "Ahh guys, you’re krilling me now!",
        "All I sea are bass-icaly cod awful puns!",
        "Any fin is possible, just don’t trout yourself!",
        "Anyone else want to rise to the bait?",
        "Are you trying to gill-t me into thinking of a better pun?",
        "Blast from the past! I caught a coelacanth! Think positive! Be a coela-CAN!",
        "Blech! I caught a giant isopod! That's a horror if ever one existed!",
        "Can you come up with a betta fish pun?",
        "Can you do any betta than this?",
        "Cod I borrow you for a few minutes?",
        "Cod you pass me the salt?",
        "Cod, that was bad... Eely bad!",
        "Create your own fish pun, don’t leave it to salmon else.",
        "DJs aren’t allowed to work at fish markets because they’re always dropping the bass.",
        "Dear Cod, I laughed so hard!",
        "Did you hear about the fight in that restaurant? Four fish were battered!",
        "Did you hear about the guy who got a tattoo of a squid? He got inked up.",
        "Did you hear about the illiterate fisherman? He was lost at C.",
        "Don’t listen to them, I think you’re fin-tastic!",
        "Even if you don't like these fish puns, they are kraken me up!",
        "Fishcious rumors.",
        "GAAAAH! I got a giant isopod! It's the crustodian of the sea.",
        "Had a girlfriend. I lobster... But then I flounder!",
        "Have you thought of a fish pun yet, or do you need some time to mullet over?",
        "He really schooled you then.",
        "Holy fish sticks! I caught a coelacanth! Am I saying it right?",
        "Hoping to avoid turtle disaster.",
        "How do you keep a fish from smelling? Chop of its nose.",
        "How do you make an octopus laugh? Give it ten-tickles.",
        "How do you tuna fish? Adjust their scales.",
        "How does a school of fish keep up to date about sea life? They listen to the current news.",
        "How does a squid go into battle? Well-armed.",
        "I bait you think these puns can’t go on for much longer.",
        "I caught a Napoleonfish! It's not as big as it thinks!",
        "I caught a Napoleonfish! Viva la me!",
        "I caught a barbel steed! It just needs a barbel saddle!",
        "I caught a barbel steed! That's funny... it looks more like a fish than a horse.",
        "I caught a barred knifejaw! I'll have to use it to cut veggies!",
        "I caught a barred knifejaw! I'm really cut up over how to turn that into a pun...",
        "I caught a barred knifejaw! They must have a hard time eating!",
        "I caught a barreleye! Like eyeing fish in a barrel!",
        "I caught a bass! If I can catch a drummer, maybe I'll form a band!",
        "I caught a betta! I betta not drop it!",
        "I caught a bitterling! I wonder what makes this little guy so angry...",
        "I caught a bitterling! It's mad at me, but only a little.",
        "I caught a bitterling! What's it so bitter about?",
        "I caught a black bass! I've got some class!",
        "I caught a black bass! The most metal of all fish!",
        "I caught a blowfish! And that's not just hot air!",
        "I caught a blowfish! I'm blown away!",
        "I caught a blue marlin! Listen to this fish. it's got a point.",
        "I caught a blue marlin! What a true darlin'!",
        "I caught a bluegill! Do you think it calls me 'pinklung'?",
        "I caught a bluegill! Don't worry, I caught the rest of the fish, too!",
        "I caught a bluegill! There's a lot in this ville!",
        "I caught a brook trout! I guess that little guy's just trOUT of luck!",
        "I caught a butterfly fish! As mayor, welcome to my pockets!",
        "I caught a butterfly fish! Did it change from a caterpillar fish?",
        "I caught a butterfly fish! Keep flying, fishy!",
        "I caught a carp! I really seized the diem!",
        "I caught a carp! If I catch another, they can carpool!",
        "I caught a carp! Ouch! I hurt my wrist! It might be CARPal-tunnel!",
        "I caught a catfish! Do you think it has 9 lives?",
        "I caught a catfish! I think I'll name it Whiskers...",
        "I caught a catfish! I'm more of a dogfish person...",
        "I caught a char! How bizarre!",
        "I caught a char! Now I'm gonna sit on it!",
        "I caught a cherry salmon! It looks so PITiful! (Get it? Pit? Oh, never mind.)",
        "I caught a cherry salmon! It's the perfect topper for a marlin sundae!",
        "I caught a cherry salmon! Now for a cherry-salmon pie!",
        "I caught a clown fish! How many can fit in a carfish?",
        "I caught a clown fish! Who's laughing now?",
        "I caught a crawfish! Check out those pincers!",
        "I caught a crawfish! Or else it's a lobster and I'm a giant!",
        "I caught a crawfish! Watch those pinchers!",
        "I caught a crucian carp! Carpe diem!",
        "I caught a crucian carp! My skills are sharp!",
        "I caught a crucian carp! What a crucial catch!",
        "I caught a dab! I'm not just dabbling anymore!",
        "I caught a dab! Not bad!",
        "I caught a dab... Huh? Just kidding! It's an olive flounder! Make up your mind, fishy!",
        "I caught a dace! Daces wild!",
        "I caught a dace! Hope I have some space!",
        "I caught a dace! Wrong place, Mr. Dace!",
        "I caught a dorado! I say 'dorado', you say 'doraydo'.",
        "I caught a dorado! I should make that my motto!",
        "I caught a football fish! Some countries call it a soccer fish!",
        "I caught a football fish! Thanks to my fishing tackle!",
        "I caught a freshwater goby! Go me, goby!",
        "I caught a freshwater goby! Time to go bye-bye!",
        "I caught a freshwater goby! You fresh, goby!",
        "I caught a frog! Hop to it, froggie!",
        "I caught a frog! Or it's a new neighbor...and I have some apologizing to do.",
        "I caught a frog! Think I should kiss it? (Ew...it's all warty!)",
        "I caught a gar! It ain't gettin' too far!",
        "I caught a gar! Yar! It's a gar! Har har!",
        "I caught a giant catfish! (That's because I used a giant mousefish as bait!)",
        "I caught a giant snakehead! But where's the rest of the snake?",
        "I caught a giant snakehead! Um...but I asked for a medium?",
        "I caught a giant snakehead! Yup! A giant snakehead. Who names these things?",
        "I caught a giant trevally! Pfff. I've seen bigger!",
        "I caught a giant trevally! Yeah, I'm pretty well-trevalled.",
        "I caught a golden trout! But the real treasure? Friendship.",
        "I caught a goldfish! It's worth its weight in fish!",
        "I caught a goldfish! It's worth its weight in gold!",
        "I caught a goldfish! Worth its weight in...fish. Great.",
        "I caught a great white shark! Watch out for its jaws!",
        "I caught a guppy! I gotta show off this puppy!",
        "I caught a guppy! It ate an awful lot of bait for being so tiny!",
        "I caught a guppy! Welcome to the team, newbie!",
        "I caught a hammerhead shark! I hit the nail on the head!",
        "I caught a hammerhead shark! I really nailed it!",
        "I caught a horse mackerel! Holy mackerel!",
        "I caught a horse mackerel! Of course, mack...er...el.",
        "I caught a jellyfish! I wonder how it would taste on some toast...",
        "I caught a killifish! Killer!",
        "I caught a killifish! Maybe I'll put it in a chili dish!",
        "I caught a killifish! The streams are safe again.",
        "I caught a koi! Can't play koi with me!",
        "I caught a koi! I don't know why it's so shy... or such a bad speller...",
        "I caught a koi! Whoever colored it did a real good job!",
        "I caught a large bass! Well, it's pretty big... I guess...",
        "I caught a large char! I wonder how it tastes charbroiled...",
        "I caught a loach! It wasn't hard to approach!",
        "I caught a loach! It's...looking at me with reproach.",
        "I caught a loach! You don't suppose it's Hylian, do you?",
        "I caught a mahi-mahi! It's all mahine-mahine.",
        "I caught a mitten crab! I'm smitten, crab!",
        "I caught a mitten crab! One more and I'm ready for winter!",
        "I caught a moray eel! And I was like, 'No way! Deal!'",
        "I caught a moray eel! When you're in love, that's a moray!",
        "I caught a neon tetra! Wasn't hard to track.",
        "I caught a neon tetra! Wow, that's far out, man!",
        "I caught a nibble fish! Come to think of it, I could use a bite!",
        "I caught a nibble fish! Do you regret nibbling now?",
        "I caught a pale chub! It could use some sun!",
        "I caught a pale chub! Looks like it could use a little sun... and a little diet.",
        "I caught a pale chub! That name seems a bit judgy...",
        "I caught a pike! Oh, yes, I like!",
        "I caught a pike! Think a swordfish would be up for a duel?",
        "I caught a piranha! Or did it catch ME?!",
        "I caught a piranha! Sure hope it was the only one!",
        "I caught a piranha! Which river is this, anyway? I'm glad I didn't take a dip!",
        "I caught a pond smelt! It could sure use a bath!",
        "I caught a pond smelt! Whew! And I thought the POND smelt bad!",
        "I caught a pond smelt! Whoever smelt it dealt it!",
        "I caught a pop-eyed goldfish! It should have eaten its spinach!",
        "I caught a popeyed goldfish! Aw, look... He wants spinach...",
        "I caught a puffer fish! I thought you would be tougher, fish!",
        "I caught a puffer fish! Ouch!",
        "I caught a rainbow trout! Now that's a trout of a different color!",
        "I caught a rainbow trout! That's what I'm talking about!",
        "I caught a rainbowfish! Where's my pot of goldfish?",
        "I caught a ranchu goldfish! But I prefer balsamicu goldfish!",
        "I caught a ray! A few more and I'll have a tan!",
        "I caught a ray! That made my day!",
        "I caught a red king crab! It's royally flushed.",
        "I caught a red king crab! Nice to meet you, Your Highness!",
        "I caught a red snapper! I just snapped it up!",
        "I caught a red snapper! It looks pretty dapper!",
        "I caught a red snapper! That was a snap! (I really have to stop saying things like that.)",
        "I caught a ribbon eel! Can it tie itself into a bow?",
        "I caught a ribbon eel! Good for tying on to presents!",
        "I caught a saddled bichir! Now I'm saddled with guilt!",
        "I caught a salmon! And it made it all the way back here! Now I feel bad.",
        "I caught a salmon! It's all upstream from here!",
        "I caught a salmon! Oh, that's slammin'!",
        "I caught a saw shark! And it didn't even see me coming!",
        "I caught a saw shark! You could call it a sea saw!",
        "I caught a scallop! Hey, this isn't a potato at all!",
        "I caught a sea bass! No, wait- it's at least a C+!",
        "I caught a sea bass! See? A bass!",
        "I caught a sea bass! See? Bass! (Why do I keep saying things like that?)",
        "I caught a sea bass! What, you again?",
        "I caught a sea butterfly! I didn't even use a net!",
        "I caught a sea butterfly! Try not to confuse it for a sea moth!",
        "I caught a sea horse! But...where's its sea jockey?",
        "I caught a sea horse! I meant to, of course!",
        "I caught a shark! GAH! Why am I holding it?!",
        "I caught a small bass! Now I just need to catch a small bass amp. (Oh, that was terrible...)",
        "I caught a snapping turtle! How can it snap without fingers?",
        "I caught a soft-shelled turtle! Don't suffer shell shock!",
        "I caught a soft-shelled turtle! I can really shell it out!",
        "I caught a soft-shelled turtle! I should take a shellfie!",
        "I caught a squid! Do they... Not actually 'bloop'?",
        "I caught a squid! I had an inkling I might!",
        "I caught a squid! It's off the hook!",
        "I caught a squid! Yes, I did!",
        "I caught a sturgeon! Wonder if it can perform sturgery...",
        "I caught a suckerfish! I thought it was a shark! Oh, wait - now I get it. 'Sucker'...",
        "I caught a surgeonfish! It was a simple operation, though!",
        "I caught a surgeonfish! Scalpel! Forceps! Fish hook!",
        "I caught a sweetfish! And let me tell you, that is one SWEET fish!",
        "I caught a sweetfish! Hmmm. I've had sweeter!",
        "I caught a sweetfish! Hope it's not artificially sweet!",
        "I caught a tadpole... I'm sure it will grow on me.",
        "I caught a tadpole... It's just a tad small.",
        "I caught a tilapia! It makes me happy-a!",
        "I caught a tuna! And now it's stuck in my head",
        "I caught a tuna! It's a little off-key!",
        "I caught a yellow perch! I wonder if birds usually stand on it!",
        "I caught a yellow perch! Those yellow birds have to sit somewhere!",
        "I caught a zebra turkeyfish! Land, air, water--make up your mind!",
        "I caught a zebra turkeyfish! What are you? Make up your mind!",
        "I caught an anchovy! Stay away from my pizza!",
        "I caught an angelfish! It looks divine!",
        "I caught an angelfish! Now where's its harp?",
        "I caught an angelfish! That other fish told me to do it!",
        "I caught an arapaima! And it looks like it's in its prime-a!",
        "I caught an arapaima! How did it get here? Arapaiknow!",
        "I caught an arowana! But where's its bow?",
        "I caught an arowana! I'd make a joke, but I don't 'wana.",
        "I caught an arowana! It's the golden dragon fish! I wonder what it's worth...",
        "I caught an eel! I've been told they're rEELy tough to catch! (I'm sorry...)",
        "I caught an eel! Things just got REAL!",
        "I caught an oarfish! Good, I needed a paddle!",
        "I caught an oarfish! I hope I catch morefish!",
        "I caught an ocean sunfish! Good thing I'm wearing ocean sunscreen!",
        "I caught an ocean sunfish! My day is brighter already!",
        "I caught an olive flounder! That's not the pits!",
        "I feel great every day of the week, barramundi.",
        "I got a Dungeness crab! Dun dun duuuun...geness.",
        "I got a Venus' flower basket! Why was she picking flowers here?",
        "I got a chambered nautilus! Is it on the naughty list?",
        "I got a chambered nautilus! Who loses? Not us! Just go with it...",
        "I got a clam! Anyone for chowder?",
        "I got a firefly squid! More like a glowswim squid.",
        "I got a flatworm! Guess it forgot its spareworm.",
        "I got a flatworm! Why's it so flat? Steamroller?",
        "I got a gazami crab! What a gripping find!",
        "I got a gigas giant clam! It's kind of a big deal.",
        "I got a horsehair crab! Because I combed the ocean floor!",
        "I got a horseshoe crab! I hope it's lucky!",
        "I got a horseshoe crab! Its luck has ran out!",
        "I got a lobster! Lobjective complete.",
        "I got a lobster! More like a sobster now!",
        "I got a manila clam! Manila is my favorite flavor of clam!",
        "I got a manila clam! These make amazing chowder. Yum!",
        "I got a mantis shrimp! Pray on someone else, ya shrimp!",
        "I got a mantis shrimp! Shrimply amazing!",
        "I got a moon jellyfish! Now to find a sun peanutbutterfish.",
        "I got a mussel! It's been working out.",
        "I got a pearl oyster! Aw, shucks. Don't clam up now!",
        "I got a pearl oyster! Mostly I just wanted the pearl!",
        "I got a pop-eyed goldfish! It looks so...surprised!",
        "I got a scallop! It otter be savored.",
        "I got a sea anemone! More like a sea ENEMY! Look out!",
        "I got a sea anemone! The enemy of my anemone is my afrenome!",
        "I got a sea cucumber! It's a bit cumbersome...",
        "I got a sea cucumber! Now to find a sea pickle!",
        "I got a sea pig! What's next? Air pigs?",
        "I got a sea pineapple! Your move, sea pizzas.",
        "I got a sea slug! It's kinda salty about that.",
        "I got a sea slug! What, it thought it could outrun me?",
        "I got a sea star! Is a group called a constellation?",
        "I got a sea star! Maybe it'll give me an autograph!",
        "I got a sea urchin! And I didn't poke myself, either!",
        "I got a sea urchin! Wasn't even 'earchin for it.",
        "I got a slate pencil urchin! Its handwriting is gorgeous.",
        "I got a snow crab! 'Sno problem, really!",
        "I got a snow crab! It's giving me the cold shoulder.",
        "I got a spider crab! Water bugs can rest easy.",
        "I got a spider crab! Who'd put spiders in the ocean?",
        "I got a spiny lobster! It's got a lot of backbone!",
        "I got a spiny lobster! Who would give lobsters SPINES?",
        "I got a spotted garden eel! Was it un-spotted before I saw it?",
        "I got a spotted garden eel! Who'll water its garden now?",
        "I got a sweet shrimp! Blech. Not sweet until cooked.",
        "I got a sweet shrimp! It's being very considerate.",
        "I got a tiger prawn! I ain't lion!",
        "I got a tiger prawn! I can sell it at a prawn shop!",
        "I got a turban shell! It's like a little fancy hat!",
        "I got a turban shell! It's totally TURB...ular!",
        "I got a vampire squid! A lot was at stake.",
        "I got a whelk! Happy snails to ya.",
        "I got an abalone! And that's no bologna!",
        "I got an abalone! Why do I want a sandwich now?",
        "I got an acorn barnacle! Maybe I can grow a barnacle tree?",
        "I got an acorn barnacle! Will it grow into an oak barnacle?",
        "I got an ear shell! And yet it couldn't hear me coming!",
        "I got an octopus! Find out about it on my podcast!",
        "I got an octopus! It can give four hugs at once!",
        "I got an oyster! He's been a bit too shellfish.",
        "I got an oyster! It's a little shellfish.",
        "I got an umbrella octopus! Too bad I'm already soaked.",
        "I got some sea grapes! Can't let these go sour.",
        "I got some sea grapes! See? Grapes!",
        "I got some seaweed! I couldn't kelp myself.",
        "I got some seaweed! I just couldn't kelp myself!",
        "I hate the water! Nah, I’m just squiddin’ around.",
        "I really believe that to the bottom of my sole.",
        "I think you’re fintastic.",
        "I won’t be cod dead participating in this.",
        "I'm free any day... Barramundi.",
        "I'm so angry I could krill someone!",
        "I'm so sofishticated.",
        "If a fish got the main role in a movie, what would it be called? Starfish.",
        "It’s a great oppor-tuna-ty!",
        "I’d make him walk the plankton for that.",
        "I’m hooked!",
        "I’m stuck between a rock and a hard plaice now!",
        "I’m waiting for someone else to mussel in on this now.",
        "Keep your friends close and your anemones closer.",
        "Let's all just clam down, shall we?",
        "Most fish will tell you they like their food cold, and their bait a little worm.",
        "My dad was a fisherman, but he quit because his net income wasn’t enough.",
        "Never trust unlicensed puns; Always check they’re o-fish-al.",
        "Not bad, cod do better...",
        "OH MY GOSH! I caught a stringfish! Five more and I'll have a guitarfish!",
        "OH MY GOSH! I caught a stringfish! My theory really paid off!",
        "Oh boy! I hooked a stringfish! I was just stringing it along...",
        "Oh for Cod's hake; Not another fish pun.",
        "Oh my Cod!",
        "Ohmigosh! I caught a whale shark! It could've swallowed me up!",
        "Or you’re so sofishticated!",
        "Salmon had to say it.",
        "Seems a bit fishy to me.",
        "Sorry my attempt at a joke was a pile of carp to you.",
        "Stop carping on; You’re giving me a haddock.",
        "Thar she blows! I caught a whale shark! I'm tellin' ya, it was thiiiiiiiiiiiiiiiiiiiis big!",
        "That's enough fish puns... I think we should scale back.",
        "This is a big issue a-monk fishermen.",
        "This is going to get a-trout-cious real quick!",
        "This is neither the time, nor the plaice, for this.",
        "WOO-HOO! I caught a King salmon! Checkmate!",
        "WOW!!! I caught an arapaima! This thing is huge!",
        "We all just need to clam down now; I’m a bit shell shocked.",
        "We should dolphinitely scale back on the fish puns.",
        "We whaley need to stop now!",
        "We, the jury, find this site gill-ty of too many fish puns!",
        "We’re swimming along nicely.",
        "Whale, whale, whale; What do we have here?",
        "What a load of pollocks!",
        "What did Dorothy the fish say? There’s no plaice like home.",
        "What did the businessman say to the squid? Hey, the print cartridge is out of ink; Could we use some of yours?",
        "What did the fish say to his girlfriend when they split up? I’m outta this plaice!",
        "What did the fish say to his girlfriend? You plaice or mine?",
        "What did the fish say when everyone left his party? Tanks for coming!",
        "What did the fish say when his relationship started to flounder? Halibut we chat about it?",
        "What did the fish take to work? A b-reef-case.",
        "What did the romantic fisherman want? A gill-friend.",
        "What did the squid say on its birthday? This is going to be inkredible!",
        "What did the squid say when it was asked out on a date? I’ll ink about it.",
        "What do you call two squids that look exactly the same? Itentacle.",
        "What does a fish wear to keep warm? A shoal!",
        "What fish travels 100 mph? A motor pike.",
        "What happens when you mix a fish and a banker? A loan shark.",
        "What makes fish terrible journalists? They always spread hake news.",
        "What type of instrument do fish love to play? A bass drum.",
        "What type of music is best to listen to while fishing? Something catchy!",
        "What’s the difference between a lawyer and a fish? One is a scum-sucking scavenger; The other is just a fish.",
        "What’s the laziest fish in the world? A Kipper.",
        "What’s this fish pun website you’ve been herring all about?",
        "Where did Noah keep all of the fish? In the multi-storey carp ark.",
        "Where do fish store their money? In a river bank.",
        "Where do sick fish go? To see a sturgeon.",
        "Where do you find a down-and-out octopus? On squid row.",
        "Which fish go to heaven? Angelfish.",
        "Who do fish pray to? Cod Almighty.",
        "Who held the baby octopus to ransom? Squidnappers.",
        "Who robs banks and squirts ink? Billy the Squid.",
        "Who will be the sole survivor?",
        "Why are fish so lucky? They seize every oppor-tuna-ty.",
        "Why are fish so smart? They live in schools.",
        "Why can’t fish have romantic relationships? They are scared of intima-sea.",
        "Why did the fish blush? Because he saw the boat's bottom.",
        "Why did the fish blush? Because the sea-weed!",
        "Why did the fish get a detention? Because he was being too shellfish.",
        "Why did the fish get bad grades? Because it was below sea level.",
        "Why did the fish start a charity? He was reely good at findraising.",
        "Why did the little boy not eat his sushi? Because it looked too fishy.",
        "Why did the shopkeeper through the clams out? They were past their shell-by-date.",
        "Why did the squid blush? He saw the bottom of the ocean.",
        "Why did the teenage fish get told off in school? Because he was talking on his shell phone.",
        "Why did the woman make tons of fish-eye soup? Because it will see her through the week.",
        "Why do fish always lose their court cases? They are always gill-ty.",
        "Why do fish companies never work? They always have to scale back.",
        "Why do fish not go to war? Because they are paci-fish-ts.",
        "Why do fish swim in schools? Because they can’t walk.",
        "Why does this taste funny? Oh, that'd be the clownfish!",
        "Why don’t fish go into business together? They are always sole traders.",
        "Why is a fisherman so stingy? Because his work made him sell-fish.",
        "Why is it so easy to weigh a fish? Because they have their own scales.",
        "Why should you never fight an octopus? Because he’s too well armed.",
        "Why will fish never take responsibility? Because it’s always salmon else’s fault.",
        "Woohoo! Woohoo! I caught a king salmon! Where are his horses and men?",
        "Would you look at that! I caught a living fossil! I didn't know they really existed!",
        "Wow! A saddled bichir! And me without my tiny riding crop...",
        "You betta believe it.",
        "You better not, or you’ll feel my wrasse!",
        "You don’t have to be a brain sturgeon to come up with a fish pun.",
        "You've just been schooled.",
        "You’re clearly a dab hand at this.",
        "You’re not quite up to scale.",
        "You’ve met your nemo-sis."
    ]
}