[
    "Whale, where do we begin? You’ve come to the right plaice to find the very best fish puns.",
    "Do you try to think of good fish puns, but just flounder? Well, the bait is over.",
    "Don't like these puns? Well, if you can think of anything batter after having a trawl through them, let <@228880116699103232> know!",
    "Ahh guys, you’re krilling me now!",
    "All I sea are bass-icaly cod awful puns!",
    "Any fin is possible, just don’t trout yourself!",
    "Anyone else want to rise to the bait?",
    "Are you trying to gill-t me into thinking of a better pun?",
    "Can you come up with a betta fish pun?",
    "Can you do any betta than this?",
    "Cod I borrow you for a few minutes?",
    "Cod you pass me the salt?",
    "Cod, that was bad... Eely bad!",
    "Create your own fish pun, don’t leave it to salmon else.",
    "DJs aren’t allowed to work at fish markets because they’re always dropping the bass.",
    "Dear Cod, I laughed so hard!",
    "Did you hear about the fight in that restaurant? Four fish were battered!",
    "Did you hear about the guy who got a tattoo of a squid? He got inked up.",
    "Did you hear about the illiterate fisherman? He was lost at C.",
    "Don’t listen to them, I think you’re fin-tastic!",
    "Even if you don't like these fish puns, they are kraken me up!",
    "Fishcious rumors.",
    "Had a girlfriend. I lobster... But then I flounder!",
    "Have you thought of a fish pun yet, or do you need some time to mullet over?",
    "He really schooled you then.",
    "Hoping to avoid turtle disaster.",
    "How do you keep a fish from smelling? Chop of its nose.",
    "How do you make an octopus laugh? Give it ten-tickles.",
    "How do you tuna fish? Adjust their scales.",
    "How does a school of fish keep up to date about sea life? They listen to the current news.",
    "How does a squid go into battle? Well-armed.",
    "I bait you think these puns can’t go on for much longer.",
    "I feel great every day of the week, barramundi.",
    "I hate the water! Nah, I’m just squiddin’ around.",
    "I really believe that to the bottom of my sole.",
    "I think you’re fintastic.",
    "I won’t be cod dead participating in this.",
    "I'm free any day... Barramundi.",
    "I'm reely eelin' it!",
    "I'm so angry I could krill someone!",
    "I'm so sofishticated.",
    "If a fish got the main role in a movie, what would it be called? Starfish.",
    "It’s a great oppor-tuna-ty!",
    "I’d make him walk the plankton for that.",
    "I’m hooked!",
    "I’m stuck between a rock and a hard plaice now!",
    "I’m waiting for someone else to mussel in on this now.",
    "Keep your friends close and your anemones closer.",
    "Let's all just clam down, shall we?",
    "Most fish will tell you they like their food cold, and their bait a little worm.",
    "My dad was a fisherman, but he quit because his net income wasn’t enough.",
    "Never trust unlicensed puns; Always check they’re o-fish-al.",
    "Not bad, cod do better...",
    "Oh for Cod's hake; Not another fish pun.",
    "Oh my Cod!",
    "Salmon had to say it.",
    "Seems a bit fishy to me.",
    "Sorry my attempt at a joke was a pile of carp to you.",
    "Stop carping on; You’re giving me a haddock.",
    "That's enough fish puns... I think we should scale back.",
    "This is a big issue a-monk fishermen.",
    "This is going to get a-trout-cious real quick!",
    "This is neither the time, nor the plaice, for this.",
    "We all just need to clam down now; I’m a bit shell shocked.",
    "We should dolphinitely scale back on the fish puns.",
    "We whaley need to stop now!",
    "We, the jury, find this site gill-ty of too many fish puns!",
    "We’re swimming along nicely.",
    "Whale, whale, whale; What do we have here?",
    "What a load of pollocks!",
    "What did Dorothy the fish say? There’s no plaice like home.",
    "What did the businessman say to the squid? Hey, the print cartridge is out of ink; Could we use some of yours?",
    "What did the fish say to his girlfriend when they split up? I’m outta this plaice!",
    "What did the fish say to his girlfriend? You plaice or mine?",
    "What did the fish say when everyone left his party? Tanks for coming!",
    "What did the fish say when his relationship started to flounder? Halibut we chat about it?",
    "What did the fish take to work? A b-reef-case.",
    "What did the romantic fisherman want? A gill-friend.",
    "What did the squid say on its birthday? This is going to be inkredible!",
    "What did the squid say when it was asked out on a date? I’ll ink about it.",
    "What do you call two squids that look exactly the same? Itentacle.",
    "What does a fish wear to keep warm? A shoal!",
    "What fish travels 100 mph? A motor pike.",
    "What happens when you mix a fish and a banker? A loan shark.",
    "What makes fish terrible journalists? They always spread hake news.",
    "What type of instrument do fish love to play? A bass drum.",
    "What type of music is best to listen to while fishing? Something catchy!",
    "What’s the difference between a lawyer and a fish? One is a scum-sucking scavenger; The other is just a fish.",
    "What’s the laziest fish in the world? A Kipper.",
    "What’s this fish pun website you’ve been herring all about?",
    "Where did Noah keep all of the fish? In the multi-storey carp ark.",
    "Where do fish store their money? In a river bank.",
    "Where do sick fish go? To see a sturgeon.",
    "Where do you find a down-and-out octopus? On squid row.",
    "Which fish go to heaven? Angelfish.",
    "Who do fish pray to? Cod Almighty.",
    "Who held the baby octopus to ransom? Squidnappers.",
    "Who robs banks and squirts ink? Billy the Squid.",
    "Who will be the sole survivor?",
    "Why are fish so lucky? They seize every oppor-tuna-ty.",
    "Why are fish so smart? They live in schools.",
    "Why can’t fish have romantic relationships? They are scared of intima-sea.",
    "Why did the fish blush? Because he saw the boat's bottom.",
    "Why did the fish blush? Because the sea-weed!",
    "Why did the fish get a detention? Because he was being too shellfish.",
    "Why did the fish get bad grades? Because it was below sea level.",
    "Why did the fish start a charity? He was reely good at findraising.",
    "Why did the little boy not eat his sushi? Because it looked too fishy.",
    "Why did the shopkeeper throw the clams out? They were past their shell-by-date.",
    "Why did the squid blush? He saw the bottom of the ocean.",
    "Why did the teenage fish get told off in school? Because he was talking on his shell phone.",
    "Why did the woman make tons of fish-eye soup? Because it will see her through the week.",
    "Why do fish always lose their court cases? They are always gill-ty.",
    "Why do fish companies never work? They always have to scale back.",
    "Why do fish not go to war? Because they are paci-fish-ts.",
    "Why do fish swim in schools? Because they can’t walk.",
    "Why does this taste funny? Oh, that'd be the clownfish!",
    "Why don’t fish go into business together? They are always sole traders.",
    "Why is a fisherman so stingy? Because his work made him sell-fish.",
    "Why is it so easy to weigh a fish? Because they have their own scales.",
    "Why should you never fight an octopus? Because he’s too well armed.",
    "Why will fish never take responsibility? Because it’s always salmon else’s fault.",
    "You betta believe it.",
    "You better not, or you’ll feel my wrasse!",
    "You don’t have to be a brain sturgeon to come up with a fish pun.",
    "You've just been schooled.",
    "You’re clearly a dab hand at this.",
    "You’re not quite up to scale.",
    "You’ve met your nemo-sis."
]