{
    "trash": {
      "puns": [
        "I caught a boot! I hope someone lost this AND DIDN'T TOSS IT HERE!",
        "I caught a boot! It, uh, wasn't made for swimming.",
        "I caught a boot! Keep our waters clean!",
        "I caught a boot! Now where's your mate?",
        "I caught an empty can! Aren't you supposed to catch the fish before you can it?",
        "I caught an empty can! Aw, maaaan...",
        "I caught an empty can! This isn't a can... it's a CAN't!",
        "I caught an empty can! You CAN't litter!",
        "I caught an old tire! Did this come from Gracie's car?!",
        "I caught an old tire! I sure am tired of that!",
        "I caught an old tire! It was just treading water...",
        "I caught an old tire! Whose car did this come from?",
        "You caught a tire! Blech! Roll on over to the dump and drop it off!",
        "You caught an empty can! Nasty! You can't throw it back in!",
        "You caught an old shoe! Gross! Put your foot down and say NO to littering!"    
      ],
      "weight": 9
    },
    "common": {
      "puns": [
        "I caught a barbel steed! I'm not horsin' around!",
        "I caught a barbel steed! It just needs a barbel saddle!",
        "I caught a barbel steed! That's funny... It looks more like a fish than a horse.",
        "I caught a barbel steed! What a noble steed, indeed!",
        "I caught a bass! If I can catch a drummer, maybe I'll form a band!",
        "I caught a bitterling! But it's pretty sweet to me!",
        "I caught a bitterling! I wonder what makes the little guy so angry...",
        "I caught a bitterling! It's mad at me, but only a little.",
        "I caught a bitterling! So small, so very bitter!",
        "I caught a bitterling! What's it so bitter about?",
        "I caught a black bass! I've got some class!",
        "I caught a black bass! That couldn't BE more bass!",
        "I caught a black bass! The most metal of all fish!",
        "I caught a black bass! Turn up the bass!",
        "I caught a bluegill! Do you think it calls me 'pinklung'?",
        "I caught a bluegill! Don't worry! I caught the rest of the fish, too!",
        "I caught a bluegill! Now that takes some skill!",
        "I caught a bluegill! There's a lot in this ville!",
        "I caught a bluegill! Why's the little guy so sad?",
        "I caught a carp! Carpe carp!",
        "I caught a carp! I really seized the diem!",
        "I caught a carp! If I catch another, they can carpool!",
        "I caught a carp! Ouch! I hurt my wrist! It might be CARPal-tunnel!",
        "I caught a carp! Pretty sharp!",
        "I caught a catfish! Do you think it has 9 lives?",
        "I caught a catfish! Here, kitty kitty!",
        "I caught a catfish! I think I'll name it Whiskers...",
        "I caught a catfish! I'm more of a dogfish person...",
        "I caught a catfish! Who's meowing now?!",
        "I caught a crawfish! Check out those pincers!",
        "I caught a crawfish! Don't pinch me!",
        "I caught a crawfish! Or else it's a lobster, and I'm a giant!",
        "I caught a crawfish! Stick that in your craw!",
        "I caught a crawfish! Watch those pinchers!",
        "I caught a crucian carp! Carpe diem!",
        "I caught a crucian carp! I'm looking pretty sharp!",
        "I caught a crucian carp! My skills are sharp!",
        "I caught a crucian carp! What a crucial catch!",
        "I caught a dab! And I'm feeling fab!",
        "I caught a dab! Didja see it? You're a dab, right?",
        "I caught a dab! I'm not just dabbling anymore!",
        "I caught a dab! Not bad!",
        "I caught a dab! Oh wait... Are you an olive flounder? Oh, yeah, you are, aren't you?",
        "I caught a dab... Huh? Just kidding! It's an olive flounder! Make up your mind, fishy!",
        "I caught a dace! Dace in the hole!",
        "I caught a dace! Daces wild!",
        "I caught a dace! Hope I have some space!",
        "I caught a dace! Wooo! In your face!",
        "I caught a dace! Wrong place, Mr. Dace!",
        "I caught a frog! Hop to it, froggie!",
        "I caught a frog! Leapin'... lizards?",
        "I caught a frog! Or it's a new neighbor... and I have some apologizing to do.",
        "I caught a frog! Think I should kiss it? (Ew... It's all warty!)",
        "I caught a frog! What up, frog?",
        "I caught a horse mackerel! But it sounds fine to me!",
        "I caught a horse mackerel! Holy mackerel!",
        "I caught a horse mackerel! Nay!? Yay!",
        "I caught a horse mackerel! Of course, mack...er...el.",
        "I caught a jellyfish! I wonder how it would taste on some toast...",
        "I caught a jellyfish! I'm in some kind of jam!",
        "I caught a jellyfish! Now all I need is a peanut-butter fish.",
        "I caught a loach! Don't encroach on my loach!",
        "I caught a loach! I'm the loach coach!",
        "I caught a loach! It wasn't hard to approach!",
        "I caught a loach! It's...looking at me with reproach.",
        "I caught a loach! You don't suppose it's Hylian, do you?",
        "I caught a pale chub! Chub a dub dub!",
        "I caught a pale chub! It could use some sun!",
        "I caught a pale chub! Looks like it could use a little sun...and a little diet.",
        "I caught a pale chub! That name seems a bit judgy...",
        "I caught a pond smelt! It could sure use a bath!",
        "I caught a pond smelt! What does the pond smell like?",
        "I caught a pond smelt! Whew! And I thought the POND smelt bad!",
        "I caught a pond smelt! Whew! This guy's ripe!",
        "I caught a pond smelt! Whoever smelt it dealt it!",
        "I caught a rainbow trout! A trout of many colors!",
        "I caught a rainbow trout! Now that's a trout of a different color!",
        "I caught a rainbow trout! That's what I'm talking about!",
        "I caught a rainbow trout! Where's my pot of gold?!",
        "I caught a salmon! And it made it all the way back here! Now I feel bad.",
        "I caught a salmon! It's all upstream from here!",
        "I caught a salmon! Now we're jammin'!",
        "I caught a salmon! Oh, that's slammin'!",
        "I caught a salmon! Welcome back!",
        "I caught a sea bass! No, wait- it's at least a C+!",
        "I caught a sea bass! Not again!",
        "I caught a sea bass! Not you again!",
        "I caught a sea bass! See? A bass!",
        "I caught a sea bass! See? Bass! (Why do I keep saying things like that?)",
        "I caught a sea bass! What?! You again?!",
        "I caught a small bass! Now I just need to catch a small bass amp. (Oh, that was terrible...)",
        "I caught a squid! Do they...not actually 'bloop'?",
        "I caught a squid! I had an inkling I might!",
        "I caught a squid! It's off the hook!",
        "I caught a squid! Oh no I squidn't!",
        "I caught a squid! Oh yes I squid!",
        "I caught a squid! Yes, I did!",
        "I caught a sweetfish! And let me tell you, that is one SWEET fish!",
        "I caught a sweetfish! Deeeeelish!",
        "I caught a sweetfish! Hmmm. I've had sweeter!",
        "I caught a sweetfish! Hope it's not artificially sweet!",
        "I caught a sweetfish! Sweeeeet!",
        "I caught a tadpole... I'm sure it will grow on me.",
        "I caught a tadpole... It's just a tad small.",
        "I caught a tilapia! It makes me happy-a!",
        "I caught a yellow perch! I wonder if birds usually stand on it!",
        "I caught a yellow perch! Perch in my belly!",
        "I caught a yellow perch! Those yellow birds have to sit somewhere!",
        "I caught a yellow perch! Why's the little guy so scared?",
        "I caught a zebra turkeyfish! Gobble gobble OW!",
        "I caught a zebra turkeyfish! Land, air, water—make up your mind!",
        "I caught a zebra turkeyfish! What are you? Make up your mind!",
        "I caught an anchovy! Stay away from my pizza!",
        "I caught an eel! I'm just eel-lated!",
        "I caught an eel! I've been told they're rEELy tough to catch! (I'm sorry...)",
        "I caught an eel! Slippery little sucker!",
        "I caught an eel! Things just got REAL!",
        "I caught an octopus! Now its a shockedopus!",
        "I caught an octopus! You're mine, suckers!",
        "I caught an olive flounder! Hey, flatty bo batty!",
        "I caught an olive flounder! That's not the pits!",
        "I got a chambered nautilus! Is it on the naughty list?",
        "I got a chambered nautilus! Who loses? Not us! Just go with it...",
        "I got a clam! Anyone for chowder?",
        "I got a Dungeness crab! Dun dun duuuun...geness.",
        "I got a gazami crab! What a gripping find!",
        "I got a manila clam! Manila is my favorite flavor of clam!",
        "I got a manila clam! These make amazing chowder. Yum!",
        "I got a mantis shrimp! Pray on someone else, ya shrimp!",
        "I got a mantis shrimp! Shrimply amazing!",
        "I got a moon jellyfish! Now to find a sun peanutbutterfish.",
        "I got a mussel! It's been working out.",
        "I got a pearl oyster! Aw, shucks. Don't clam up now!",
        "I got a pearl oyster! Mostly I just wanted the pearl!",
        "I got a sea anemone! More like a sea ENEMY! Look out!",
        "I got a sea anemone! The enemy of my anemone is my afrenome!",
        "I got a sea cucumber! It's a bit cumbersome...",
        "I got a sea cucumber! Now to find a sea pickle!",
        "I got a sea pineapple! Your move, sea pizzas.",
        "I got a sea slug! It's kinda salty about that.",
        "I got a sea slug! What, it thought it could outrun me?",
        "I got a sea star! Is a group called a constellation?",
        "I got a sea star! Maybe it'll give me an autograph!",
        "I got a sea urchin! And I didn't poke myself, either!",
        "I got a sea urchin! Wasn't even 'earchin for it.",
        "I got a sweet shrimp! Blech. Not sweet until cooked.",
        "I got a sweet shrimp! It's being very considerate.",
        "I got a turban shell! It's like a little fancy hat!",
        "I got a turban shell! It's totally TURB...ular!",
        "I got a whelk! Happy snails to ya.",
        "I got an acorn barnacle! Maybe I can grow a barnacle tree?",
        "I got an acorn barnacle! Will it grow into an oak barnacle?",
        "I got an ear shell! And yet it couldn't hear me coming!",
        "I got an octopus! Find out about it on my podcast!",
        "I got an octopus! It can give four hugs at once!",
        "I got an oyster! He's been a bit too shellfish.",
        "I got an oyster! It's a little shellfish.",
        "I got some sea grapes! Can't let these go sour.",
        "I got some sea grapes! See? Grapes!",
        "I got some seaweed! I just couldn't kelp myself!"
      ],
      "weight": 60
    },
    "uncommon": {
      "puns": [
        "AWESOME! I caught a football fish! TOUCHDOWN!",
        "I caught a blowfish! And that's not just hot air!",
        "I caught a blowfish! I'm blown away!",
        "I caught a blue marlin! Hey there, little darlin'!",
        "I caught a blue marlin! Listen to this fish. It's got a point.",
        "I caught a blue marlin! What a true darlin'!",
        "I caught a blue marlin! Why so blue, marlin?",
        "I caught a football fish! Some countries call it a soccer fish!",
        "I caught a football fish! Thanks to my fishing tackle!",
        "I caught a football fish! Well, well... you've came a long way!",
        "I caught a gar! Gar har har HAAAAR!",
        "I caught a gar! It ain't gettin' too far!",
        "I caught a gar! Nose like a GARden hose!",
        "I caught a gar! Yar! It's a gar! Har har!",
        "I caught a giant trevally! Pfff. I've seen bigger!",
        "I caught a giant trevally! Yeah, I'm pretty well-trevalled.",
        "I caught a koi! Can't play koi with me!",
        "I caught a koi! Don't be coy! (Ugh.),",
        "I caught a koi! I don't know why it's so shy... or such a bad speller...",
        "I caught a koi! Oh, boy!",
        "I caught a koi! Whoever colored it did a real good job!",
        "I caught a mahi-mahi! It's all mahine-mahine.",
        "I caught a mitten crab! I'm smitten, crab!",
        "I caught a mitten crab! One more and I'm ready for winter!",
        "I caught a moray eel! And I was like, 'No way! Deal!'",
        "I caught a moray eel! Now that's a moray!",
        "I caught a moray eel! When you're in love, that's a moray!",
        "I caught a Napoleonfish! It's not as big as it thinks!",
        "I caught a Napoleonfish! Look at the hat on this guy!",
        "I caught a Napoleonfish! Viva la me!",
        "I caught a piranha! Bite the bait, not me!!",
        "I caught a piranha! He'd better not catch me!",
        "I caught a piranha! Or did it catch ME?!",
        "I caught a piranha! Sure hope it was the only one!",
        "I caught a piranha! Which river is this, anyway? I'm glad I didn't take a dip!",
        "I caught a ranchu goldfish! But I prefer balsamicu goldfish!",
        "I caught a ray! A few more and I'll have a tan!",
        "I caught a ray! Hip hip HOORAY!",
        "I caught a ray! That made my day!",
        "I caught a red king crab! It's royally flushed.",
        "I caught a red king crab! Nice to meet you, Your Highness!",
        "I caught a saddled bichir! Now I'm saddled with guilt!",
        "I caught a scallop! Hey, this isn't a potato at all!",
        "I caught a soft-shelled turtle! Don't suffer shell shock!",
        "I caught a soft-shelled turtle! I can really shell it out!",
        "I caught a soft-shelled turtle! I should take a shellfie!",
        "I caught a soft-shelled turtle! It's more sensitive than other turtles.",
        "I caught a sturgeon! Wonder if it can perform sturgery...",
        "I caught a suckerfish! I thought it was a shark! Oh, wait - now I get it. 'Sucker'...",
        "I caught an ocean sunfish! Don't look directly at it!♪",
        "I caught an ocean sunfish! Good thing I'm wearing ocean sunscreen!",
        "I caught an ocean sunfish! I'm feeling pretty sunny now!♪",
        "I caught an ocean sunfish! My day is brighter already!",
        "I got a pop-eyed goldfish! It looks so...surprised!",
        "I got a popeyed goldfish! It's bugging out!",
        "I got a scallop! It otter be savored.",
        "I got a snow crab! 'Sno problem, really!",
        "I got a snow crab! It's giving me the cold shoulder.",
        "I got a spiny lobster! It's got a lot of backbone!",
        "I got a spiny lobster! Who would give lobsters SPINES?",
        "I got a vampire squid! A lot was at stake.",
        "I got an umbrella octopus! Too bad I'm already soaked.",
        "Whoo hoo! Whoo hoo! I caught a king salmon! All hail the new king! ME!",
        "WOO-HOO! I caught a king salmon! Checkmate!",
        "Woohoo! I caught a King salmon! All hail the king! For I am the fish king!",
        "Woohoo! Woohoo! I caught a king salmon! Where are his horses and men?"
      ],
      "weight": 20
    },
    "rare": {
      "puns": [
        "I caught a barreleye! Like eyeing fish in a barrel!",
        "I caught a dorado! I should make that my motto!",
        "I caught a dorado! Now that's rad-o!",
        "I caught a dorado! ♪I say 'Dorado', you say 'Doraydo.'♪",
        "I caught a golden trout! But the real treasure? Friendship.",
        "I caught a great white shark! Watch out for its jaws!",
        "I caught a hammerhead shark! Got any nails?",
        "I caught a hammerhead shark! Got any nails?",
        "I caught a hammerhead shark! I hit the nail on the head!",
        "I caught a hammerhead shark! I hit the nail on the head!",
        "I caught a hammerhead shark! I really nailed it!",
        "I caught a hammerhead shark! I really nailed it!",
        "I caught a hammerhead shark! Knew I just had to keep hammering away at it!",
        "I caught a hammerhead shark! Knew I just had to keep hammering away at it!",
        "I caught a saw shark! And it didn't even see me coming!",
        "I caught a saw shark! You could call it a sea saw!",
        "I caught a shark! Check out that toothy grin!",
        "I caught a shark! GAH! Why am I holding it?!",
        "I caught a shark! It was a shark attack!",
        "I caught a tuna! And I'm not talking canned!",
        "I caught a tuna! And now it's stuck in my head",
        "I caught a tuna! I only wish I'd caught it soona!",
        "I caught a tuna! It's a little off-key!",
        "I caught an arapaima! And it looks like it's in its prime-a!",
        "I caught an arapaima! How did it get here? Arapaiknow!",
        "I caught an arapaima! It's about time-a!",
        "I caught an arapaima! It's big... and kinda gross!",
        "I caught an arowana! But where's its bow?",
        "I caught an arowana! I'd make a joke, but I don't 'wana.",
        "I caught an arowana! It's golden and beautiful!",
        "I caught an arowana! It's golden and gorgeous!",
        "I caught an arowana! It's the golden dragon fish! I wonder what it's worth...",
        "I caught an oarfish! Good, I needed a paddle!",
        "I caught an oarfish! I hope I catch morefish!",
        "I found a pearl! Could today get anymore pearl-fect?",
        "I got a gigas giant clam! It's kind of a big deal.",
        "I got a sea pig! What's next? Air pigs?",
        "I got a spider crab! Water bugs can rest easy.",
        "I got a spider crab! Who'd put spiders in the ocean?",
        "I got a Venus' flower basket! Why was she picking flowers here?"
      ],
      "weight": 10
    },
    "legendary": {
      "puns": [
        "A coelacanth? I caught a living fossil! Amazing! Who knew these things were still around?",
        "AWESOME! I caught a football fish! TOUCHDOWN!",
        "Blast from the past! I caught a coelacanth! Think positive! Be a coela-CAN!",
        "Blech! I caught a giant isopod! That's a horror if ever one existed!",
        "GAAAAH! I got a giant isopod! It's the crustodian of the sea.",
        "Holy fish sticks! I caught a coelacanth! Am I saying it right?",
        "Oh boy! I hooked a stringfish! I was just stringing it along...",
        "OH MY GOSH! I caught a stringfish! Five more and I'll have a guitarfish!",
        "OH MY GOSH! I caught a stringfish! My theory really paid off!",
        "OH MY GOSH! I caught a stringfish! This is AWESOME! ♪",
        "Ohhh, boy! I hooked a stringfish! I was just stringing it along...",
        "Ohmigosh! I caught a whale shark! It could've swallowed me up!",
        "Thar she blows! I caught a whale shark! I'm tellin' ya, it was thiiiiiiiiiiiiiiiiiiiis big!",
        "Whoa! A golden fish. I think this is a dorado! Who knew they lived here!?",
        "Whoa! Whoa! Whoa! I caught a living fossil! Amazing! What are you doing down there?",
        "Whoa... I caught a stringfish! I completely rock! YIPPEEEEEE!",
        "Whoo hoo! Whoo hoo! I caught a king salmon! All hail the new king! ME!",
        "WOO-HOO! I caught a king salmon! Checkmate!",
        "Woohoo! I caught a King salmon! All hail the king! For I am the fish king!",
        "Woohoo! Woohoo! I caught a king salmon! Where are his horses and men?",
        "Would you look at that! I caught a living fossil! I didn't know they really existed!",
        "Wow! A saddled bichir! And me without my tiny riding crop...",
        "WOW!!! I caught an arapaima! This thing is huge!"
      ],
      "weight": 1
    }
  }
  