[
  {
    "riddle": "What do you call a sad coffee?",
    "answer": "A depresso."
  },
  {
    "riddle": "What could ruin and fix your life at the same time?",
    "answer": "Money"
  },
  {
    "riddle": "What question can you honestly never answer “yes”to?",
    "answer": "Are you sleeping?"
  },
  {
    "riddle": "My spine is stiff, my body is pale, I’m always ready to tell a tale. What am I?",
    "answer": "A book"
  },
  {
    "riddle": "I am full of holes yet I have no problem holding water. What am I?",
    "answer": "A sponge"
  },
  {
    "riddle": "I am not alive, but I grow. I don’t have lungs, but I need air. I don’t have a mouth, but water kills me. What am I?",
    "answer": "Fire"
  },
  {
    "riddle": "If eleven plus two equals one, what does nine plus five equal?",
    "answer": "On a clock, 11:00 plus 2 hours = 1:00, 9:00 plus 5 hours = 2:00"
  },
  {
    "riddle": "I met a man on the London bridge, he tipped his hat and drew his cane, in this riddle I told you his name. What is it?",
    "answer": "Andrew (“and drew his cane”)"
  },
  {
    "riddle": "I am seven letter word. I am very heavy. Take away two letters from me and you will get 8. Take away one letter and you will get 80. Who am I?",
    "answer": "Weighty"
  },
  {
    "riddle": "A man went around the world in a ship. Yet he was always in sight of land. How is that possible?",
    "answer": "He was in a spaceship"
  },
  {
    "riddle": "I’m light as a feather, yet the strongest person can’t hold me for five minutes. What am I?",
    "answer": "Breath"
  },
  {
    "riddle": "In 1990, a person is 15 years old. In 1995, that same person is 10 years old. How can this be?",
    "answer": "It is because it’s 1995-1990 B.C.!"
  },
  {
    "riddle": "The eight of us go forth not back to protect our king from a foes attack.  What are we?",
    "answer": "Chess pawns"
  },
  {
    "riddle": "What is a skeleton’s favorite snack?",
    "answer": "Spare ribs"
  },
  {
    "riddle": "I am an animal named after the animal that I eat, what am I?",
    "answer": "Anteater"
  },
  {
    "riddle": "If you have me you want to share me, if you share me you won’t have me. What am I?",
    "answer": "A seceret"
  },
  {
    "riddle": "You walk into a room with a rabbit eating a carrot, a pig eating slop and a monkey eating a banana. Which is the smartest animal in the room?",
    "answer": "You"
  },
  {
    "riddle": "I come from a mine and get surrounded by wood.  Everyone uses me, what am I?",
    "answer": "A pencil"
  },
  {
    "riddle": "Mr. Red lives in the red house. Mr. Blue lives in the blue house. Mrs. Pink lives in the pink house? Who lives in the white house?",
    "answer": "The President"
  },
  {
    "riddle": "If two is company and three is a crowd, what is 4 and 5?",
    "answer": "Nine"
  },
  {
    "riddle": "I am clean when i’m black and dirty when i’m white. What am I?",
    "answer": "A blackboard"
  },
  {
    "riddle": "I am neither a guest or a trespasser be, to this place I belong, it belongs also to me.",
    "answer": "Home"
  },
  {
    "riddle": "I’m tall when I’m young and short when I’m old. What am I?",
    "answer": "A candle"
  },
  {
    "riddle": "I start with M, end with X, and have a never ending amount of letters. What am I?",
    "answer": "Mailbox"
  },
  {
    "riddle": "I once was full of thoughts but now I am white and empty. What am I?",
    "answer": "A skull"
  },
  {
    "riddle": "Only one color, but not one size, Stuck at the bottom, yet easily flies. Present in sun, but not in rain, Doing no harm, and feeling no pain. What is it?",
    "answer": "A shadow"
  },
  {
    "riddle": "I always run but never walk, I sometimes sing but cannot talk, No head on which a hat to place, You always look me in the face. What am I?",
    "answer": "A clock"
  },
  {
    "riddle": "Take off my skin and I won’t cry, but you will, what am I?",
    "answer": "Onion"
  },
  {
    "riddle": "What begins when things end and ends all things that begin?",
    "answer": "Death"
  },
  {
    "riddle": "What has 88 keys but can’t open a single door?",
    "answer": "A piano"
  },
  {
    "riddle": "I am always in front of you and never behind you.  What am I?",
    "answer": "The future"
  },
  {
    "riddle": "How many species of animals did Moses take on the Ark with him?",
    "answer": "None, Noah was on the Ark, not Moses"
  },
  {
    "riddle": "I am a kind who is good at measuring things.  What am I?",
    "answer": "A ruler"
  },
  {
    "riddle": "What is the least spoken language in the world?",
    "answer": "Sign language"
  },
  {
    "riddle": "I run in and out of town all day and night but I never get tired.  What am I?",
    "answer": "Roads"
  },
  {
    "riddle": "What is in front of a woman and at the back of a cow?",
    "answer": "The letter W"
  },
  {
    "riddle": "If two is company and three is a crowd, what is four and five?",
    "answer": "Nine"
  },
  {
    "riddle": "What do you call a snowman in summer?",
    "answer": "Water"
  },
  {
    "riddle": "What can go up a chimney down but can’t go down a chimney up?",
    "answer": "An umbrella"
  },
  {
    "riddle": "You just bought a cute rabbit at a pet store.  The rabbit can breed once every month, and deliver 7 babies at a time.  How many rabbits do you have after 12 months?",
    "answer": "One, it takes two rabbits to breed."
  },
  {
    "riddle": "Tom’s height is six feet, he is an assistant at a butcher’s shop, and wears size 12 shoes. What does he weigh?",
    "answer": "Meat"
  },
  {
    "riddle": "What has a head and a tail, is brown, and has no legs?",
    "answer": "A penny"
  },
  {
    "riddle": "What is never hungry at Thanksgiving?",
    "answer": "The turkey because it is always stuffed"
  },
  {
    "riddle": "What did the baseball glove say to the baseball?",
    "answer": "Catch ya later!"
  },
  {
    "riddle": "I get whiter the dirtier I get. What am I?",
    "answer": "A blackboard"
  },
  {
    "riddle": "What can be seen in the middle of March and April that cannot be seen at the beginning or end of either month?",
    "answer": "The letter “R”"
  },
  {
    "riddle": "I am born of water but when I return to water, I die. What am I?",
    "answer": "Ice"
  },
  {
    "riddle": "There is an apple tree on a cliff. If the wind is blowing 15mph to the West, where would the apple fall?",
    "answer": "Down!"
  },
  {
    "riddle": "I can’t be bought, but I can be stolen with a glance. I’m worthless to one, but priceless to two. What am I?",
    "answer": "Love"
  },
  {
    "riddle": "What starts with an e but only has a single letter in it?",
    "answer": "An envelope"
  },
  {
    "riddle": "Slayer of regrets, old and new, sought by many, found by few. What am I?",
    "answer": "Redemption"
  },
  {
    "riddle": "Five add six is eleven, but six add seven is one. How is that possible?",
    "answer": "When you are looking at a clock"
  },
  {
    "riddle": "What is the softest nut in the entire world?",
    "answer": "A Donut"
  },
  {
    "riddle": "What is greater than God, more evil than the devil, the poor have it, the rich need it, and if you eat it, you’ll die?",
    "answer": "Nothing"
  },
  {
    "riddle": "What do you call a fly with no wings?",
    "answer": "A walk"
  },
  {
    "riddle": "When does Halloween come before Valentine’s day?",
    "answer": "In a dictionary"
  },
  {
    "riddle": "Its ready to walk when I’m all tied up, but really should stop when I’m untied. What am I?",
    "answer": "Shoes"
  },
  {
    "riddle": "What kind of corn starts with the letter A?",
    "answer": "Acorn"
  },
  {
    "riddle": "Why did the grandma put wheels on her rocking chair?",
    "answer": "Because she likes to rock and roll"
  },
  {
    "riddle": "Why did I go golfing with two pairs of pants on?",
    "answer": "Just in case I get a hole in 1."
  },
  {
    "riddle": "What does a cat have that other animals do not have?",
    "answer": "Kittens"
  },
  {
    "riddle": "What is a mathematician’s favorite dessert?",
    "answer": "Pi"
  },
  {
    "riddle": "I always run but never walk, I sometimes sing but cannot talk, No head on which a hat to place, You always look me in the face.  What am I?",
    "answer": "A clock"
  },
  {
    "riddle": "A rooster lays an egg on the roof of a barn. Which way does the egg roll?",
    "answer": "I doesn’t, roosters don’t lay eggs."
  },
  {
    "riddle": "What does almost no one what, yet almost no one wants to lose?",
    "answer": "Their job"
  },
  {
    "riddle": "How can you make a car, a parrot, a refrigerator, and a TV liquid?",
    "answer": "Sell them"
  },
  {
    "riddle": "I am always in front of you but never behind you.  What am I?",
    "answer": "The Future"
  },
  {
    "riddle": "No matter how much it rains, it never gets any wetter.  What is it?",
    "answer": "Water"
  },
  {
    "riddle": "What gives you the strength and power to walk through walls?",
    "answer": "Doors"
  },
  {
    "riddle": "If a dozen eggs cost 12 cents how much does 100 eggs cost?",
    "answer": "$1 (100 cents)"
  },
  {
    "riddle": "What food goes on and on without a beginning, middle, or an end?",
    "answer": "A donut"
  },
  {
    "riddle": "I have a toungue but cannot talk. I have no legs but sometimes walk. What am I?",
    "answer": "A shoe"
  },
  {
    "riddle": "Why did the coffee file a police report?",
    "answer": "It was mugged!"
  },
  {
    "riddle": "I start with an e and end with an e. I have whole countries inside of me. What am I?",
    "answer": "Europe"
  },
  {
    "riddle": "Why would a hair stylist rather cut the hair of two brunettes than one red head?",
    "answer": "They would make more money."
  },
  {
    "riddle": "What is the mistake in the the following question?",
    "answer": "The word “the” is repeated."
  },
  {
    "riddle": "What has many ears but cannot hear?",
    "answer": "A cornfield"
  },
  {
    "riddle": "What is stronger than steel but cowers from the sun?",
    "answer": "Ice"
  },
  {
    "riddle": "What three words are said too much, yet not enough?",
    "answer": "I love you"
  },
  {
    "riddle": "What stays where it is when it goes off?",
    "answer": "An alarm clock."
  },
  {
    "riddle": "Which side of a cat always has the most fur?",
    "answer": "The outside"
  },
  {
    "riddle": "Your mother and father have a child. It is not your brother and it is not your sister. Who is it?",
    "answer": "It is you!"
  },
  {
    "riddle": "A doctor gives you three pills and tells you to take one every 30 minutes.  How long does it take to run out of pills?",
    "answer": "One hour"
  },
  {
    "riddle": "A man is sitting in his cabin in Colorado. Three hours later he gets out of his cabin in Texas. How is this possible?",
    "answer": "The man is a pilot and the cabin is the cockpit of a plane."
  },
  {
    "riddle": "Which kind of nuts are the softest nuts?",
    "answer": "Donuts"
  },
  {
    "riddle": "What has wings but can’t fly, legs but can’t walk, and eyes but can’t see?",
    "answer": "A dead bird"
  },
  {
    "riddle": "What is the safest room to be in during a zombie apocalypse?",
    "answer": "The living room"
  },
  {
    "riddle": "I am an ancient invention allows people to see through walls? What am I?",
    "answer": "A window"
  },
  {
    "riddle": "A box without hinges, key or lid, yet golden treasure inside is hid. What am I?",
    "answer": "An egg"
  },
  {
    "riddle": "What does a snowman eat for breakfast?",
    "answer": "Snowflakes!"
  },
  {
    "riddle": "There are 10 people on a boat and nobody is below deck but not a single person is in sight. How is this possible?",
    "answer": "They are all married."
  },
  {
    "riddle": "Those who have it least don’t know that they have it. Those who have it most wish they had less of it, but not too little or none at all. What is it?",
    "answer": "Age"
  },
  {
    "riddle": "Spelled forwards I’m what you do everyday, spelled backwards I’m something you hate.  What am I?",
    "answer": "Live"
  },
  {
    "riddle": "What goes in the water red and comes out black?",
    "answer": "Iron"
  },
  {
    "riddle": "You cannot keep me until you have given me. What am I?",
    "answer": "Your word!"
  },
  {
    "riddle": "What is hard to find but easy to lose, worth more than gold but costs less than a penny?",
    "answer": "A friend."
  },
  {
    "riddle": "I am a seed with three letters in my name. Take away two letters and I sound quite the same.  What am I?",
    "answer": "Pea"
  },
  {
    "riddle": "Round like a apple, deep like a cup, yet all the kings horses cannot pull it up. What is it?",
    "answer": "A well"
  },
  {
    "riddle": "What is a rich person’s favorite type of nut?",
    "answer": "A cashew!"
  },
  {
    "riddle": "What has a tongue but cannot talk and gets around a lot but cannot walk?",
    "answer": "A shoe"
  },
  {
    "riddle": "Why is an older one hundred dollar bill worth more than a newer one?",
    "answer": "Because it is worth $100 which is more than a newer $1 bill."
  },
  {
    "riddle": "If you have a bee in your hand, what do you have in your eye?",
    "answer": "Beauty, because beauty is in the eye of the bee-holder!"
  },
  {
    "riddle": "When you do not know what I am, then I am something. When you know what I am, then I am nothing. What am I?",
    "answer": "A riddle"
  },
  {
    "riddle": "A man is 24 years old but has only had 6 birthdays. How is that possible?",
    "answer": "He was born on February 29th."
  },
  {
    "riddle": "A king, queen and two twins all lay in a large room, yet there are no adults or children in the room.  How is that possible?",
    "answer": "They are all beds.  "
  },
  {
    "riddle": "What is it that after you take away the whole, some still remains?",
    "answer": "Wholesome"
  },
  {
    "riddle": "You can run but cannot walk. You have a mouth but cannot talk. You have a head but never weep and have a bed but never sleep. What are you?",
    "answer": "A river"
  },
  {
    "riddle": "I have eight to spare and am covered with hair. What am I?",
    "answer": "A cat"
  },
  {
    "riddle": "I have two arms, but fingers none. I have two feet, but cannot run. I carry well, but I have found I carry best with my feet off the ground. What am I?",
    "answer": "A wheelbarrow"
  },
  {
    "riddle": "A man goes to buy a used car. He finds a nice Corvette for $8700 and he buys it without paying a dime. How is that possible?",
    "answer": "He didn’t pay a dime, he paid $8,700."
  },
  {
    "riddle": "After you go through a fall I will take over. All life will stall, or at least grow slower. What am I?",
    "answer": "Winter"
  },
  {
    "riddle": "I am a mother’s child and a father’s child but nobody’s son. What am I?",
    "answer": "A Daughter"
  },
  {
    "riddle": "What flies when it’s born, lies when it’s alive, and runs when it’s dead?",
    "answer": "A snowflake"
  },
  {
    "riddle": "I build bridges of silver and crowns of gold. Who am I?",
    "answer": "A dentist"
  },
  {
    "riddle": "What connects two people but touches only one?",
    "answer": "A wedding ring"
  },
  {
    "riddle": "A one-seeded fruit I may be, but all of your calendars are full of me.  What am I?",
    "answer": "Dates"
  },
  {
    "riddle": "What is the first thing you see in an emergency but you only see it twice in a lifetime?",
    "answer": "The letter ‘e’."
  },
  {
    "riddle": "I have hundreds of legs but I can only lean, you make me feel dirty so you can feel clean. What am I?",
    "answer": "A broom"
  },
  {
    "riddle": "What time of day is spelled the same forwards and backwards?",
    "answer": "Noon"
  },
  {
    "riddle": "What is it that even the most careful person always overlooks?",
    "answer": "Their nose."
  },
  {
    "riddle": "A pizza weighs ten pounds plus half its own weight. How much does the pizza weigh?",
    "answer": "20 pounds.  10 pounds plus half of 20 pounds equals 20 pounds."
  },
  {
    "riddle": "Two people both eat exactly half of a chocolate bar and nothing else, but one person eats more than the other. How is that possible?",
    "answer": "They each eat half of their own chocolate bar, one chocolate bar is bigger than the other."
  },
  {
    "riddle": "If you throw me out of a window,  you’ll leave a grieving wife.  If you leave me in the middle of the door,  you might just save a life.  What am I?",
    "answer": "The letter “N”."
  },
  {
    "riddle": "How many bricks does it take to complete a 2,000 square foot building made entirely of brick?",
    "answer": "Only one, the last brick completes the building."
  },
  {
    "riddle": "What begins but has no end and is the ending of all that begins?",
    "answer": "Death"
  },
  {
    "riddle": "When is 1600 plus 25 and 1700 minus 35 the same thing?",
    "answer": "When you are using military time."
  },
  {
    "riddle": "I am not a holiday. I belong in the month of December, but not in any other month. What am I?",
    "answer": "The letter “d”."
  },
  {
    "riddle": "I am heavy forwards and not backwards. What am I?",
    "answer": "Ton"
  },
  {
    "riddle": "Two in a corner, one in a room, zero in a house, but one in a shelter. What am I?",
    "answer": "The letter “r”."
  },
  {
    "riddle": "When I point up, it’s bright. When I point down, it’s dark. What am I?",
    "answer": "A light switch."
  },
  {
    "riddle": "Three eyes have I, all in a row; when the red one opens, no one can go. What am I?",
    "answer": "A traffic light"
  },
  {
    "riddle": "What question can you never honestly say yes to?",
    "answer": "Are you asleep?"
  },
  {
    "riddle": "You can hear me and control me, but never see me or touch me.  What am I?",
    "answer": "Your voice"
  },
  {
    "riddle": "What question can someone ask all day long, always get totally different answers, and yet all the answers could be correct?",
    "answer": "What time is it?"
  },
  {
    "riddle": "How can you smell if you don’t have a nose?",
    "answer": " Don’t take a shower."
  },
  {
    "riddle": "Which tire does not move when a car turns right?",
    "answer": "The spare tire."
  },
  {
    "riddle": "A man is lying shot on the road. The police come to investigate. Right away, they know who shot him. Why?",
    "answer": "He is only shot, not dead."
  },
  {
    "riddle": "What do you give to others but still try and keep?",
    "answer": "A promise"
  },
  {
    "riddle": "A family has five children: January, February, March and April. What is the fifth child’s name.",
    "answer": "What is the name of the child.  This one is tricky, it did not ask a question."
  },
  {
    "riddle": "What has 13 hearts but no organs?",
    "answer": "A deck of cards"
  },
  {
    "riddle": "When does Christmas come before Thanksgiving?",
    "answer": "In the dictionary."
  },
  {
    "riddle": "A guy has 367 apples. You take away 34. How many apples do you have?",
    "answer": "34, because you took 34."
  },
  {
    "riddle": "What has teeth but can’t eat?",
    "answer": "A comb.  Things like a saw or a zipper could “bite” you."
  },
  {
    "riddle": "I am first on earth, second on heaven. I appear twice in a week, never in a month, but once in a year. What am I?",
    "answer": "The letter E"
  },
  {
    "riddle": "Three men are on a boat. The boat sinks but only two people get their hair wet. Why?",
    "answer": "The third man was bald."
  },
  {
    "riddle": "Where do locksmiths go on vacation?",
    "answer": "The Florida Keys"
  },
  {
    "riddle": "Jack and Jill were found on the ground dead with with water and shattered glass around them. What happened?",
    "answer": "Jack and Jill were fish, their bowl fell and broke."
  },
  {
    "riddle": "What does everyone need, want, and ask for for but never take?",
    "answer": "Advice"
  },
  {
    "riddle": "Why does Jupiter fart so much?",
    "answer": "Because it’s a giant gas planet."
  },
  {
    "riddle": "What do you call a group of a dozen atoms?",
    "answer": "Dozen matter."
  },
  {
    "riddle": "I am a ship that can be made to ride the greatest waves. I am not built by tool, but built by hearts and minds. What am I?",
    "answer": "Friendship"
  },
  {
    "riddle": "Why don’t tall mountains ever catch a cold?",
    "answer": "Because they have a snow cap."
  },
  {
    "riddle": "In what month of the year do people eat the least amount of food?",
    "answer": "February (It is the shortest month)"
  },
  {
    "riddle": "Why are there no living cats on Mars?",
    "answer": "Curiosity"
  },
  {
    "riddle": "I get smaller every time I take a bath.  What am I?",
    "answer": "Soap"
  },
  {
    "riddle": "They are dark and on the run, without sun there will be none. What are they?",
    "answer": "Shadows"
  },
  {
    "riddle": "What is a rappers favorite candy?",
    "answer": "Eminem’s"
  },
  {
    "riddle": "What five letter word stays the same when you take away the first, third, and last letter?",
    "answer": "Empty"
  },
  {
    "riddle": "If two is a company and three is a crowd. What is four and five?",
    "answer": "Nine"
  },
  {
    "riddle": "Which of Santa’s reindeer has bad manners?",
    "answer": "Rude-olph!"
  },
  {
    "riddle": "What goes through towns and over hills but never moves?",
    "answer": "Roads"
  },
  {
    "riddle": "They come out at night without being called.  They are lost in the day without being stolen.  What are they?",
    "answer": "Stars"
  },
  {
    "riddle": "What is a snowman’s favorite cereal?",
    "answer": "Frosted Flakes"
  },
  {
    "riddle": "I can be cracked, I can be made. I can be told, I can be played. What am I?",
    "answer": "A joke"
  },
  {
    "riddle": "What has hands but can’t pick up anything?",
    "answer": "A clock"
  },
  {
    "riddle": "I can breathe but never talk, I can run but never walk, I can be picked but never be chosen. What am I?",
    "answer": "A nose"
  },
  {
    "riddle": "Which word contains all 26 letters but only three syllables?",
    "answer": "Alphabet"
  },
  {
    "riddle": "What is the difference between a teacher and a train?",
    "answer": "A teacher says, “spit out your gum” and a train goes, “chew, chew”."
  },
  {
    "riddle": "I can bring a smile to your face, a tear to your eye, or even a thought to your mind. But, I can’t be seen. What am I?",
    "answer": "A memory"
  },
  {
    "riddle": "Everyone has me but nobody can lose me.  What am I?",
    "answer": "A shadow"
  },
  {
    "riddle": "What kind of men are always above board?",
    "answer": "Chessmen"
  },
  {
    "riddle": "I start off dry but come out wet.  I go in light and come out heavy. What am I?",
    "answer": "A teabag"
  },
  {
    "riddle": "What is it that no one wants yet no one want to lose?",
    "answer": "A lawsuit"
  },
  {
    "riddle": "What has branches and leaves but has no bark?",
    "answer": "A library"
  },
  {
    "riddle": "What do you throw away that keeps on returning?",
    "answer": "Boomerang"
  },
  {
    "riddle": "You use me from your head to your toes, the more I work the thinner I grow.  What am I?",
    "answer": "A bar of soap"
  },
  {
    "riddle": "Tear one off and scratch my head; what was once red is black instead.  What am I?",
    "answer": "A match"
  },
  {
    "riddle": "What is made of wood but can’t be sawed?",
    "answer": "Sawdust"
  },
  {
    "riddle": "I am always hungry. I must be fed. Whatever I touch will soon turn red. What am I?",
    "answer": "Fire"
  },
  {
    "riddle": "Tear off my skin and I won’t cry but you will.  What am I?",
    "answer": "Onion"
  },
  {
    "riddle": "What goes all around a hockey rink but never moves?",
    "answer": "The Boards!"
  },
  {
    "riddle": "What type of lion never roars?",
    "answer": "A dandelion!"
  },
  {
    "riddle": "I Start with M, end with X and have never ending amount of letters. What am I?",
    "answer": "MAIL BOX"
  },
  {
    "riddle": "A woman is sitting in her room at night. She has no lights on, no candle, no lamp, no light at all and yet she is reading. How is that possible?",
    "answer": "She is reading braille."
  },
  {
    "riddle": "What do tigers have that no other animal can have?",
    "answer": "Baby tigers"
  },
  {
    "riddle": "Why did the snail paint a big “S” on his car?",
    "answer": "So everyone would say, “look at that escargot”."
  },
  {
    "riddle": "I start with S and end with IT, and have you in the middle. What am I?",
    "answer": "Suit"
  },
  {
    "riddle": "What do you call a famous lobster?",
    "answer": "A lobSTAR"
  },
  {
    "riddle": "What is often returned but is never borrowed?",
    "answer": "Thanks "
  },
  {
    "riddle": "I have cities but no houses, moutains but no trees, and water but no fish. What am I?",
    "answer": "A map"
  },
  {
    "riddle": "What has hundreds of ears but can’t hear?",
    "answer": "A corn field (it has ears of corn)"
  },
  {
    "riddle": "What did the boy coffee say to the girl coffee?",
    "answer": "I love you a latte"
  },
  {
    "riddle": "What month do all soldiers hate?",
    "answer": "March"
  },
  {
    "riddle": "Where can you find success before work?",
    "answer": "In the dictionary"
  },
  {
    "riddle": "What do you call a three humped camel?",
    "answer": "Pregnant!"
  },
  {
    "riddle": "Why is an island like the letter “T”?",
    "answer": "Because both are in the middle of the water. (T is the middle word of “water”)."
  },
  {
    "riddle": "What do you call a tick that loves math?",
    "answer": "A arithmetic."
  },
  {
    "riddle": "Why do you never bring a Pokemon in the bathroom, with you?",
    "answer": "They might pickachu! (peek at you)"
  },
  {
    "riddle": "I’m often running yet I have no legs.  You need me but I don’t need you.  What am I?",
    "answer": "Water"
  },
  {
    "riddle": "What ten letter word starts with gas?",
    "answer": "Automobile"
  },
  {
    "riddle": "Why is it so easy to measure fish?",
    "answer": "Because they come with their own scales."
  },
  {
    "riddle": "Why couldn’t you hear the pterodactyl go to the bathroom?",
    "answer": "Because its extinct"
  },
  {
    "riddle": "Joe’s father had three son’s Snap, Crackle and?",
    "answer": "Joe"
  },
  {
    "riddle": "How does Lady Gaga like her sushi?",
    "answer": "Raw raw, raw raw raw"
  },
  {
    "riddle": "I am a seed with three letters in my name. Take away the last two and I still sound the same. What am I?",
    "answer": "Pea"
  },
  {
    "riddle": "Why didn’t the skeleton cross the road?",
    "answer": "He did not have the guts"
  },
  {
    "riddle": "I’m am everywhere and a part of everyone. I am at the end of space and time and existence itself. What am I?",
    "answer": "The letter E"
  },
  {
    "riddle": "What has 13 hearts but no other organs?",
    "answer": "A pack of playing cards"
  },
  {
    "riddle": "What is 3/7 chicken, 2/3 cat and 2/4 goat?",
    "answer": "Chicago"
  },
  {
    "riddle": "What do you call a Bee that eats other Bees?",
    "answer": "Hannibal Nectar"
  },
  {
    "riddle": "What can you never get rid of when you lose it?",
    "answer": "Your temper"
  },
  {
    "riddle": "I can’t be seen, found, heard or smelled. I lie behind stars and under hills, I fill empty holes, come first and follow after. What am I?",
    "answer": "The dark"
  },
  {
    "riddle": "What is something that you always have but always leave behind?",
    "answer": "Fingerprints"
  },
  {
    "riddle": "What room in your house do ghosts avoid?",
    "answer": "The living room"
  },
  {
    "riddle": "What when read from right to left is a servant but when read from left to right is a ruler?",
    "answer": "God"
  },
  {
    "riddle": "How do you know carrots are good for your eyes?",
    "answer": "You never see rabbits wearing glasses."
  },
  {
    "riddle": "What do you call a fish with 4 eyes?",
    "answer": "Fiiiish"
  },
  {
    "riddle": "This old one runs forever but never moves at all. He has not lungs nor throat, but still has a mighty roaring call who is he?",
    "answer": "A waterfall"
  },
  {
    "riddle": "What do the numbers 11, 69, 88, and 96 all have in common?",
    "answer": "They are all read the same upside down."
  },
  {
    "riddle": "Why can’t you trust the law of gravity?",
    "answer": "Because it will always let you down."
  },
  {
    "riddle": "You are my brother but I am not your brother.  Who am I?",
    "answer": "Your sister"
  },
  {
    "riddle": "What is lighter than a feather but the world’s strongest man can’t hold for Long?",
    "answer": "Your breath"
  },
  {
    "riddle": "What do sea otters use for money?",
    "answer": "Sand dollars"
  },
  {
    "riddle": "What comes one time in today, three times in tomorrow and never in the future?",
    "answer": "The letter ‘O’"
  },
  {
    "riddle": "What is a pirates favorite letter?",
    "answer": "Ah, a pirates first love will always be the C, but they can’t make it without the R."
  },
  {
    "riddle": "What is the mistake in the the following list: ABCDEFGHIJKLMNOPQRSTUVWXYZ?",
    "answer": "The word “the” is repeated."
  },
  {
    "riddle": "What can you fill a room with that takes up no space?",
    "answer": "Light"
  },
  {
    "riddle": "What city has no people?",
    "answer": "Electricity"
  },
  {
    "riddle": "What does a fish say when it runs into a concrete wall?",
    "answer": "Dam"
  },
  {
    "riddle": "What has one head, one foot, and four legs?",
    "answer": "A bed"
  },
  {
    "riddle": "A man was taking a walk and it started to rain. He did not bring an umbrella or wear a hat. All of his clothes got wet but not a single hair got wet. How is this possible?",
    "answer": "He was bald."
  },
  {
    "riddle": "What has 12 faces and 42 eyes?",
    "answer": "A pair of dice."
  },
  {
    "riddle": "What has keys but no locks, Space but no room, You can enter but you can’t exit.",
    "answer": "A keyboard"
  },
  {
    "riddle": "What time starts and stops with an “n”?",
    "answer": "Noon"
  },
  {
    "riddle": "What stays in one corner but travels around the world?",
    "answer": "A stamp"
  },
  {
    "riddle": "Why can’t your nose be 12 inches long?",
    "answer": "Because it would be a foot!"
  },
  {
    "riddle": "What is one in every doll, in every doll, in every doll?",
    "answer": "Russian nesting dolls"
  },
  {
    "riddle": "Who are people you see everyday, but you don’t know?",
    "answer": "Strangers"
  },
  {
    "riddle": "What has one foot and no legs but carries its house?",
    "answer": "A snail"
  },
  {
    "riddle": "Can you write “cow” using thirteen letters?",
    "answer": "See o double you."
  },
  {
    "riddle": "What is green and smells like blue paint?",
    "answer": "Green paint"
  },
  {
    "riddle": "What kind of storm is always in a rush?",
    "answer": "Hurricane"
  },
  {
    "riddle": "What is a duck’s favorite snack?",
    "answer": "Quackers"
  },
  {
    "riddle": "What’s the difference between a well dressed man on a bicycle and a poorly dressed man on a unicycle?",
    "answer": "Attire"
  },
  {
    "riddle": "What moves without seeing and cries without eyes?",
    "answer": "A cloud"
  },
  {
    "riddle": "If I stand on top of a hill and ring a loud bell between two houses. Which house will hear the bell first?",
    "answer": "Neither, houses don’t have ears can’t hear."
  },
  {
    "riddle": "What is the tree that we all carry in our hand?",
    "answer": "Palm"
  },
  {
    "riddle": "What is the building that you leave without ever having entered.",
    "answer": "The hospital that you were born in."
  },
  {
    "riddle": "How do you spell hard water with only three letters?",
    "answer": "ICE"
  },
  {
    "riddle": "If one man can dig one hole in two days, how long will it take for two men to dig half a hole?",
    "answer": "There’s no such thing as half a hole."
  },
  {
    "riddle": "What can you hold in your left hand but can never hold in your right hand?",
    "answer": "Your right hand."
  },
  {
    "riddle": "I exist in life but not in death.  You can’t have fun without me.  What am I?",
    "answer": "The letter “f”."
  },
  {
    "riddle": "Say my name and I am no more.  What am I?",
    "answer": "Silence"
  },
  {
    "riddle": "What instrument can you hear but never see?",
    "answer": "Your voice"
  },
  {
    "riddle": "What kind of fish chases a mouse?",
    "answer": "A catfish."
  },
  {
    "riddle": "I shave everyday but my beard always stays the same. Who am I?",
    "answer": "A barber"
  },
  {
    "riddle": "A son and engineer go fishing. The boy was the engineer’s son but the engineer wasn’t the boy’s dad. How was this possible?",
    "answer": "The engineer was the boy’s mom."
  },
  {
    "riddle": "If I am holding a bee, what do I have in my eye?",
    "answer": "Beauty, because beauty is in the eye of the bee-holder!"
  },
  {
    "riddle": "What did the blanket say to the reassure the frightened bed?",
    "answer": "Don’t worry, I’ve got you covered"
  },
  {
    "riddle": "What kind of coat can you only put on when it’s wet?",
    "answer": "A coat of paint."
  },
  {
    "riddle": "How did the computer get drunk?",
    "answer": "It took to many screenshots!"
  },
  {
    "riddle": "A man walks into a bathroom shoots himself in the head.  Later he walks out unharmed. How did he survive?",
    "answer": "He shot his reflection in the mirror."
  },
  {
    "riddle": "Two coins add up to 30 cents.  One of them is not a nickel.  What are the coins?",
    "answer": "A quarter and a nickel.  One of the coins is not a nickel but the other one is."
  },
  {
    "riddle": "What pulls you down and never lets go?",
    "answer": "Gravity"
  },
  {
    "riddle": "A man kills his wife and hides the body in some bushes. The next day the police call and say his wife has been murdered and tell the man to come to the crime scene right away. As soon as the man gets there he is arrested. Why?",
    "answer": "The police never told him where the crime scene was."
  },
  {
    "riddle": "What flies without eyes and cries without eyes?",
    "answer": "A cloud"
  },
  {
    "riddle": "A rooster laid an egg on top of a barn, which way did it fall?",
    "answer": "Roosters don’t lay eggs."
  },
  {
    "riddle": "Why weren’t the first french fries made in France?",
    "answer": "Because they were made in grease!"
  },
  {
    "riddle": "Imagine you are in a sinking boat and surrounded by sharks. What could you do to survive?",
    "answer": "Stop imagining"
  },
  {
    "riddle": "What do you throw out when you need it but put away when you don’t?",
    "answer": "An anchor"
  },
  {
    "riddle": "One day a man jumped from a plane without a parachute and suffered no injuries, how is that possible?",
    "answer": "The plane was on the ground."
  },
  {
    "riddle": "I am dark, nobody can see me, I’m very far, nothing can escape me. What am I?",
    "answer": "A black hole"
  },
  {
    "riddle": "What makes you, young?",
    "answer": "Adding the letters “ng”."
  },
  {
    "riddle": "I’m always hungry and must be fed, the finger I touch will soon turn red, what am I?",
    "answer": "A fire"
  },
  {
    "riddle": "What fruit do you find in the sea?",
    "answer": "Currents!"
  },
  {
    "riddle": "What gets bigger the more you take away from it?",
    "answer": "A hole"
  },
  {
    "riddle": "You see a boat filled with people. It has not sunk, but when you look again, you don’t see a single person there. Why?",
    "answer": "They are all married"
  },
  {
    "riddle": "What number is twice the sum of it’s digits?",
    "answer": "18"
  },
  {
    "riddle": "Railroad crossing, watch out for the cars, how do you spell that without any R’s?",
    "answer": "That. How do you spell THAT."
  },
  {
    "riddle": "Why did the tomato turn red?",
    "answer": "Because he saw the salad dressing!"
  },
  {
    "riddle": "There is a dog on one side of a lake and a woman on the other. The woman calls the dog over and when he gets there he is not wet at all. How is this possible?",
    "answer": "The lake is frozen."
  },
  {
    "riddle": "How do trees get onto the internet?",
    "answer": "They log on"
  },
  {
    "riddle": "When I’m first said, I’m quite mysterious,  but when I’m explained, I’m nothing serious.  What am I?",
    "answer": "A Riddle!"
  },
  {
    "riddle": "Why shouldn’t you give Elsa a balloon?",
    "answer": "Because she’ll ”let it go”."
  },
  {
    "riddle": "The person who made it never used it and the person who used it never saw it, what is it?",
    "answer": "A Caskit"
  },
  {
    "riddle": "I have hands I can move but I cannot clap, what am I?",
    "answer": "A Clock"
  },
  {
    "riddle": "When do you start when it’s red but stop when it’s green?",
    "answer": "When you are eating a watermelon."
  },
  {
    "riddle": "What is at the end of every rainbow?",
    "answer": "The letter “W”"
  },
  {
    "riddle": "With the rich I am blue, with the poor I am red, with the amphibian I am cold but with the dog I am hot instead, what am I?",
    "answer": "Blood"
  },
  {
    "riddle": "I am odd number, remove one letter and I become even, what number am I?",
    "answer": "Seven, take out the “S” and it will become even."
  },
  {
    "riddle": "I am weightless but can be seen. Put me in a bucket and I’ll make it lighter. What am I?",
    "answer": "A Hole"
  },
  {
    "riddle": "What do you see once in a year, twice in a week, but only twice in forever?",
    "answer": "The letter E"
  },
  {
    "riddle": "How many people are dead in a standard grave yard?",
    "answer": "All of them!"
  },
  {
    "riddle": "Why couldn’t the toilet paper cross the road?",
    "answer": "It kept getting stuck in the cracks."
  },
  {
    "riddle": "What has two ends but no beginning?",
    "answer": "A rope"
  },
  {
    "riddle": "What gets broken without being held?",
    "answer": "A promise"
  },
  {
    "riddle": "There are 7 birds in a tree. A hunter shoots one bird down. How many birds are left in the tree?",
    "answer": "None because the rest of them got scared and flew away."
  },
  {
    "riddle": "What kind of table is good for you to eat?",
    "answer": "Vegetable"
  },
  {
    "riddle": "A plane crashes directly on the border of the US and Canada. Where do they bury the survivors?",
    "answer": "You don’t bury survivors."
  },
  {
    "riddle": "What do you call a can opener that doesn’t work?",
    "answer": "A can’t opener."
  },
  {
    "riddle": "I have a ring, but no hands. I used to be plugged into the wall but now I follow you every where. What am I?",
    "answer": "A Telephone"
  },
  {
    "riddle": "What season dose Humpty Dumpty hate the most?",
    "answer": "The Fall"
  },
  {
    "riddle": "When is the best time to go to the dentist?",
    "answer": "Tooth-Hurty"
  },
  {
    "riddle": "I am black when clean and white when dirty. What am I?",
    "answer": "I am a chalkboard."
  },
  {
    "riddle": "What runs around a house but does not move?",
    "answer": "A Fence."
  },
  {
    "riddle": "Why did the ice cream truck break down?",
    "answer": "A secret."
  },
  {
    "riddle": "Once you have it, you want to share it. Once you share it, you don’t have it. What is it?",
    "answer": "A secret."
  },
  {
    "riddle": "A man is in his car. He sees three doors; a golden one, a diamond one and a silver one. Which door does he go through first?",
    "answer": "His car door"
  },
  {
    "riddle": "My goal is to have $12. If I save $1 a month then it will take me 12 months to save $12. If I save $2 a month then it will take me 6 months to save $12. What if I saved $1.50 each month? How many months would it take me to save $12?",
    "answer": "8 months"
  },
  {
    "riddle": "I start with M and end with X. I have a never ending amount of letters. What am I?",
    "answer": "A mailbox"
  },
  {
    "riddle": "A construction worker fell off a 100 foot ladder but didn’t die. How is that possible?",
    "answer": "He fell off the bottom rung."
  },
  {
    "riddle": "What can elephants make that no other animals can make?",
    "answer": "Baby elephants."
  },
  {
    "riddle": "What time do the ducks wake up in the morning?",
    "answer": "At the quack of dawn."
  },
  {
    "riddle": "How many days in a week start with the letter T?",
    "answer": "Four (Today, Tuesday, Thursday, and Tomorrow)"
  },
  {
    "riddle": "Your in a room with no doors and no windows and soon you will run out of air. The only things in the room are a table and a mirror. How do you get out?",
    "answer": "First you look in the mirror and see what you saw. You take the saw and cut the table in half. Two halves equal a hole. So you crawl out the hole and now your free."
  },
  {
    "riddle": "I have a head & no body, but I do have a tail.  What am I?",
    "answer": "A coin"
  },
  {
    "riddle": "What do you call a bear without an ear?",
    "answer": "A b."
  },
  {
    "riddle": "I have five and take away two, yet I am left with four. How is this possible?",
    "answer": "Take the letters F & E off of the word five. This leaves you with IV which is four in roman numerals."
  },
  {
    "riddle": "If you are running in a race and pass the second place person, what place are you in?",
    "answer": "Second place."
  },
  {
    "riddle": "I can be made and I can be played. I can be cracked and I can be told.  What am I?",
    "answer": "A joke"
  },
  {
    "riddle": "A man is able to contact his long lost brother who has never met. They agree to meet. When the brother arrives he is able to instantly pick him out from the crowd. How is that possible?",
    "answer": "They are identical twins"
  },
  {
    "riddle": "A cowboy rides in a town on Friday stays for three days and leaves on Friday. How is that possible?",
    "answer": "His horse is named Friday."
  },
  {
    "riddle": "What has a bed but doesn’t sleep and a mouth but never eats?",
    "answer": "A river"
  },
  {
    "riddle": "How fast do librarians travel?",
    "answer": "They Book"
  },
  {
    "riddle": "We see it once in a year, twice in a week but never in a day.  What is it?",
    "answer": "The letter E"
  },
  {
    "riddle": "There are 3 men on a boat with 4 cigarettes, they don’t have a lighter, how do they smoke?",
    "answer": "They toss one cigarette over board to make the boat a cigarette lighter."
  },
  {
    "riddle": "A man was stabbed in the heart, no one tried to save him but he didn’t die.  How is that possible?",
    "answer": "He was already dead."
  },
  {
    "riddle": "I am a container with no sides and no lid, yet golden treasure lays inside. What am I?",
    "answer": "An egg"
  },
  {
    "riddle": "Which letter of the alphabet contains the most water?",
    "answer": "The letter C."
  },
  {
    "riddle": "Why did the smart phone need glasses?",
    "answer": "Because it lost all of its contacts."
  },
  {
    "riddle": "What has a soul but doesn’t live and a tongue but can’t taste?",
    "answer": "A shoe"
  },
  {
    "riddle": "What did the football coach say to the broken vending machine?",
    "answer": "Give me my quarterback."
  },
  {
    "riddle": "You buy me to eat, but never eat me. What am I?",
    "answer": "Silverware"
  },
  {
    "riddle": "When is a door not a door?",
    "answer": "When it’s ajar."
  },
  {
    "riddle": "What costs nothing but is very hard to find and can easily be lost?",
    "answer": "True friendship."
  },
  {
    "riddle": "What ends everything always?",
    "answer": "The letter ‘g’."
  },
  {
    "riddle": "How do you tell a boy snowman apart from a girl snowman?",
    "answer": "Snowballs"
  },
  {
    "riddle": "The maker doesn’t want it, the buyer doesn’t use it and the user doesn’t know it.  What is it?",
    "answer": "A coffin"
  },
  {
    "riddle": "You go at red and stop at green. What am I?",
    "answer": "A watermelon"
  },
  {
    "riddle": "What is easy to spot but hard to find?",
    "answer": "Talent"
  },
  {
    "riddle": "I fly without wings and cry without eyes. What am I?",
    "answer": "A cloud"
  },
  {
    "riddle": "What do you call a three humped camel?",
    "answer": "Pregnant"
  },
  {
    "riddle": "What can you serve but not eat?",
    "answer": "A tennis ball"
  },
  {
    "riddle": "If you want me you’ll have to share me but if you share me I will be gone. What am I?",
    "answer": "A secret"
  },
  {
    "riddle": "A mansion is on fire. There are three rooms: A room full of money, a room full of expensive paintings, and a room full of gold and precious jewels. Which room do the policeman put out first?",
    "answer": "None, they are POLICEmen."
  },
  {
    "riddle": "Where can you place one line to make the following true, 5+5+5=550?",
    "answer": "Add a line to the first plus sign to make it the number 4, 545+5=550."
  },
  {
    "riddle": "What is a frog’s favorite electronic device?",
    "answer": "An iPad"
  },
  {
    "riddle": "You are trapped in a room with no windows or doors. You have a knife and an orange. How do you escape?",
    "answer": "You use the knife to cut the orange in half. Half plus half equals a hole and you escape through the hole."
  },
  {
    "riddle": "How many birthdays does the average women have?",
    "answer": "One birthday, the rest are just birthday celebrations or parties."
  },
  {
    "riddle": "There are two fathers and two sons. They walk into a candy store and each buys a candy bar for 50 cents.  The total for all of the candy bars was $1.50. How is that posibble?",
    "answer": "There was a grandfather, a father and a son."
  },
  {
    "riddle": "20+20+20=60.  How can you make 60 again by using the same number 3 times, but it can’t be 20?",
    "answer": "Use the number 5 three times, 55+5=60"
  },
  {
    "riddle": "I stay with you all the day but not at night. What am I?",
    "answer": "I am your shadow."
  },
  {
    "riddle": "How many days are there in 4 years?",
    "answer": "1461, because one of the years is a leap year. 365 x 4= 1460 + 1= 1461"
  },
  {
    "riddle": "Why do ducks have feathers on their butts?",
    "answer": "To hide their butt quacks."
  },
  {
    "riddle": "I gurgle but never speak, run but never walk, have a bed but never sleep. What am I?",
    "answer": "I am a river."
  },
  {
    "riddle": "What do you get when you mix a snowman and a wolf?",
    "answer": "Frostbite"
  },
  {
    "riddle": "There are ten cats on a boat. One jumps off. How many are left?",
    "answer": "None, they are all copycats."
  },
  {
    "riddle": "What has a bed but does not sleep, and can run but cannot walk?",
    "answer": "A river"
  },
  {
    "riddle": "What do you call a cow with no legs?",
    "answer": "Ground beef"
  },
  {
    "riddle": "I am not alive but I can grow. I do not have lungs but I need air to survive. What am I?",
    "answer": "Fire"
  },
  {
    "riddle": "A woman lives alone in a farmhouse.  Two prison escapees intend to kill whoever they see in the  farmhouse that night and hideout there.  That night, the attack happened but the woman survived.  How is that possible?",
    "answer": "The two escapees attacked and killed each other."
  },
  {
    "riddle": "There was a girl half my age when I was 12, now I am 64, how old is she?",
    "answer": "58, half of 12 is 6 so 64-6 is 58"
  },
  {
    "riddle": "Math time. If you are cold where do you go to become hot?",
    "answer": "To the corner because it is 90 degrees."
  },
  {
    "riddle": "What type of shoes do spies wear?",
    "answer": "Sneakers"
  },
  {
    "riddle": "A teacher has a class of 30 children but only 2 pupils. How is this possible?",
    "answer": "The teacher has 2 pupils in her eyes."
  },
  {
    "riddle": "Why do French people like to eat snails?",
    "answer": "They don’t like eating fast food."
  },
  {
    "riddle": "You can drop me from the tallest building and I’ll be fine, but if you drop me in water I die. What am I?",
    "answer": "Paper"
  },
  {
    "riddle": "A girl goes to her mother’s funeral and meets the man of her dreams but she doesn’t get his name or number.  Nobody knows who the man is. Three days later the girl kills her own sister. Why?",
    "answer": "To see if the man would come to her sister’s funeral."
  },
  {
    "riddle": "When does yesterday come after today?",
    "answer": "When it is in the dictionary."
  },
  {
    "riddle": "You bury me when I’m alive and dig me up when I’m dead.  What am I?",
    "answer": "A plant."
  },
  {
    "riddle": "What do you call somebody with no body and no nose?",
    "answer": "Nobody knows."
  },
  {
    "riddle": "I have an eye but cannot see. I am fast but I have no limbs. What am I?",
    "answer": "A hurricane."
  },
  {
    "riddle": "What spends the day at the window, goes to the table for meals and hides at night?",
    "answer": "A fly."
  },
  {
    "riddle": "I can be written, I can be spoken, I can be exposed, I can be broken. What am I?",
    "answer": "News"
  },
  {
    "riddle": "What do spiders in Silicon Valley want to be when they grow up?",
    "answer": "Web designers."
  },
  {
    "riddle": "Everyone has me except for a few. You may not be able to identify me but I can always identify you. What am I?",
    "answer": "Your fingerprints."
  },
  {
    "riddle": "Sometimes I walk in front of you.  Sometimes I walk behind you.  It is only in the dark that I ever leave you.  What am I?",
    "answer": "Your shadow."
  },
  {
    "riddle": "When I take five and add six, I get eleven, but when I take six and add seven, I get one. What am I?",
    "answer": "A clock."
  },
  {
    "riddle": "Most people need it,  some ask for it, some give it, but almost nobody takes it. What is it?",
    "answer": "Advice"
  },
  {
    "riddle": "A woman is sitting in her hotel room when there is a knock at the door. She opens the door to find a man whom she has never seen before. The man said “oh I’m sorry, I thought this was my room.” He then went down the hallway and took the elevator. The woman went back into her room and phoned security. Why?",
    "answer": "You don’t knock on the door of your own room."
  },
  {
    "riddle": "I turn around once. What is out will not get in. I turn around again. What is in will not get out. What am I?",
    "answer": "A key."
  },
  {
    "riddle": "How can you say “Robert and Richard Purchased A Rottweiler”, without using any R’s?",
    "answer": "Bob and Dick bought a dog."
  },
  {
    "riddle": "What goes into the water black and comes out red?",
    "answer": "Lobster"
  },
  {
    "riddle": "A boy throws a baseball.  It travels 40 feet and then goes right back to the boy.  How is that possible?",
    "answer": "The boy threw the baseball straight up in the air."
  },
  {
    "riddle": "It weighs next to nothing but no one can hold it for long.  What is it?",
    "answer": "Your breath."
  },
  {
    "riddle": "How can you give someone $83 using exactly 7 bills, without using any one dollar bills?",
    "answer": "Give them, 1 fifty dollar bill, 1 twenty dollar bill, 1 five dollar bill and 4 two dollar bills."
  },
  {
    "riddle": "How do football players stay cool during games?",
    "answer": "The stand next to the fans."
  },
  {
    "riddle": "What has 13 hearts, but no other organs?",
    "answer": "A deck of cards."
  },
  {
    "riddle": "Two girls were born to the same mother, on the same day, at the same time, in the same month and year and yet they’re not twins. How can this be?",
    "answer": "They are part of a set of triplets."
  },
  {
    "riddle": "What two letters can you use to spell the word candy?",
    "answer": "C and Y."
  },
  {
    "riddle": "What never asks questions but is often answered?",
    "answer": "A doorbell."
  },
  {
    "riddle": "Why is the letter B always cool?",
    "answer": "It is in middle of A & C."
  },
  {
    "riddle": "What comes down but never goes up?",
    "answer": "Rain"
  },
  {
    "riddle": "You want to purchase 3-cent stamps. You’re at the post office and waiting in line for your turn. How many 3-cent stamps you will get in a dozen?",
    "answer": "12"
  },
  {
    "riddle": "Why do Chinese men eat more rice than Japanese men?",
    "answer": "There are more Chinese men than Japanese men."
  },
  {
    "riddle": "What kind of vegetable is unpopular on board ships?",
    "answer": "A leek."
  },
  {
    "riddle": "6 = 12, 3= 6, but 5 does not = 10, how come?",
    "answer": "There are six letters in 12 , three letters in six and 3 letters in 10."
  },
  {
    "riddle": "I always follow my brother but you cannot see me, only him.  You cannot hear him but you can hear me.  What are we?",
    "answer": "Thunder & Lightning."
  },
  {
    "riddle": "How do you make the number 7 even without addition, subtraction, multiplication or division?",
    "answer": "Remove the s and it becomes even."
  },
  {
    "riddle": "If it’s information you seek, come and see me. If it’s pairs of letters you need, I have consecutively three. What am I?",
    "answer": "A bookkeeper."
  },
  {
    "riddle": "What is Marie Curie’s favorite food?",
    "answer": "Fission chips."
  },
  {
    "riddle": "A man is trapped in a room. The room has only two possible exits: two doors. Through the first door there is a room constructed from magnifying glass. The blazing hot sun instantly fries anything or anyone that enters. Through the second door there is a fire-breathing dragon. How does the man escape?",
    "answer": "He waits for night and goes through the first door."
  },
  {
    "riddle": "People always ask for me even though they don’t like to face me.  What am I?",
    "answer": "The truth."
  },
  {
    "riddle": "Say the following: roast, boast, coast, post.  What do you put in a toaster?",
    "answer": "Bread"
  },
  {
    "riddle": "Every night I’m told what to do and each morning I do what I’m told, but I still do not escape your scold.  What am I?",
    "answer": "An alarm clock."
  },
  {
    "riddle": "What do the following words have in common: Racecar, Civic, Eye, Level?",
    "answer": "They are all palindromes. They can be read the same backward and forward."
  },
  {
    "riddle": "Why did the boy bury his flashlight?",
    "answer": "Because the batteries died."
  },
  {
    "riddle": "Mary was born on December 25th, yet her birthday is always in the summer. How is this possible?",
    "answer": "Mary lives in the Southern Hemisphere."
  },
  {
    "riddle": "You walk into a room and see a rabbit holding a carrot, a pig eating slop, and a chimpanzee holding a banana. Which is the smartest the smartest animal in the room?",
    "answer": "Hopefully you!"
  },
  {
    "riddle": "I go up and I go down, towards the sky and the ground. I’m present and past tense too, Let’s go for a ride, me and you.  What am I?",
    "answer": "SeeSaw"
  },
  {
    "riddle": "Which word does not belong in the following list: Stop prop crop shop drop or flop?",
    "answer": "Or"
  },
  {
    "riddle": "If your aunt’s brother is not your uncle, what relation is he to you?",
    "answer": "He is your father."
  },
  {
    "riddle": "People buy me to eat but they never eat me.  What am I?",
    "answer": "Plates and cutlery."
  },
  {
    "riddle": "What time is it when an elephant sits on your fence?",
    "answer": "Time to get a new fence."
  },
  {
    "riddle": "What falls but does not break, and what breaks but does not fall?",
    "answer": "Night falls and day breaks."
  },
  {
    "riddle": "What word looks the same upside down and backwards?",
    "answer": "SWIMS"
  },
  {
    "riddle": "Two Indians are standing on a bridge one is the father of the other ones son. What is the relation between them?",
    "answer": "They are husband and wife."
  },
  {
    "riddle": "Can you name three consecutive days without using Sunday, Wednesday and Friday?",
    "answer": "Yesterday, today and tomorrow."
  },
  {
    "riddle": "What do babies and basketball players have in common?",
    "answer": "They dribble."
  },
  {
    "riddle": "A is the father of B, but B is not the son of A.  How is that possible?",
    "answer": "B is the daughter of A."
  },
  {
    "riddle": "It is said among my people that some things are improved by death. Tell me, what stinks while living but in death smells good?",
    "answer": "A pig."
  },
  {
    "riddle": "What kind of coat is best put on wet?",
    "answer": "A coat of paint."
  },
  {
    "riddle": "What does an envelope say when you lick it?",
    "answer": "Nothing, it just shuts up."
  },
  {
    "riddle": "A town has only two barbers. One of the barbers has a nice, tidy haircut, and the other has a shaggy, messy haircut. Which barber should you go to?",
    "answer": "The one with the messy haircut because he cuts the barber’s hair that has the nice haircut."
  },
  {
    "riddle": "How many men were born last year?",
    "answer": "None, only babies were born."
  },
  {
    "riddle": "Whoever makes me, tells me not. Whoever takes me, knows me not. Whoever knows me, wants me not.  What am I?",
    "answer": "Counterfeit money."
  },
  {
    "riddle": "What never gets any wetter no matter how hard it rains?",
    "answer": "Water"
  },
  {
    "riddle": "What flies when it’s born, lies when it’s alive, and runs when it’s dead?",
    "answer": "A Snowflake."
  },
  {
    "riddle": "I am a protector. I sit on a bridge. One person can see right through me, while others wonder what I hide. What am I?",
    "answer": "Sunglasses"
  },
  {
    "riddle": "I have many keys but I cannot open a single lock.  What am I?",
    "answer": "A Piano."
  },
  {
    "riddle": "On which day of the year do fewest people die?",
    "answer": "February 29th."
  },
  {
    "riddle": "What is the only word that is spelled wrong in the dictionary?",
    "answer": "Wrong"
  },
  {
    "riddle": "Two bodies have I, though both joined in one. The more I stand still the faster I run. What am I?",
    "answer": "An hourglass."
  },
  {
    "riddle": "What can you easily break but never touch?",
    "answer": "A promise."
  },
  {
    "riddle": "I contain five little items of an everyday sort. You can find all five in a tennis court. What am I?",
    "answer": "Vowels"
  },
  {
    "riddle": "I have keys but no locks. I have space but no room. You can enter but cant go outside.  What am I?",
    "answer": "Keyboard"
  },
  {
    "riddle": "What gets wetter the longer it is left out in the sun?",
    "answer": "Ice"
  },
  {
    "riddle": "What is broken if you can’t break it?",
    "answer": "A piñata."
  },
  {
    "riddle": "Two men had lunch together and order iced teas to drink. One man had five during lunch while the other man had only one. All of the drinks were poisoned. The man that had only one drink died but the man that had five drinks survived. How can that be?",
    "answer": "The poison was in the ice. The ice never had a chance to melt in drinks of the man that had five iced teas."
  },
  {
    "riddle": "What does an island and the letter T have in common?",
    "answer": "They are both in the middle of water."
  },
  {
    "riddle": "I am first on earth, second in heaven. I appear twice in a week, never in a month, but once in a year What am I?",
    "answer": "The letter “E”."
  },
  {
    "riddle": "There is a word and six letters it contains. Take one away and twelve is what remains. What word is it?",
    "answer": "The word is dozens. Take away the “s” and it becomes dozen."
  },
  {
    "riddle": "What do you get when you cross an elephant with a rhino?",
    "answer": "Elephino"
  },
  {
    "riddle": "I can tear down mountains, or build them up. I can blind a man, or enable him to see. What am I?",
    "answer": "Sand"
  },
  {
    "riddle": "What can always be measured but never can be seen?",
    "answer": "Time"
  },
  {
    "riddle": "Which is faster, hot or cold?",
    "answer": "Hot, because you can catch a cold but you can’t catch hot."
  },
  {
    "riddle": "A man went to a bar and asked the barman for a glass of water. The barman pointed a gun at him. The man said thank you and left. Why?",
    "answer": "They man had the hiccups so the barman pointed a gun at him to scare the hiccups away."
  },
  {
    "riddle": "What is the next number in the following series: 100 365 24 60?",
    "answer": "60, the are 100 years in a century, 365 days in a year, 24 hours in a day, 60 minutes in and hour and 60 seconds in a minute."
  },
  {
    "riddle": "Why did Cinderella get kicked off the football team?",
    "answer": "Because she ran away from the ball."
  },
  {
    "riddle": "Divide 20 by half and add 30, what do you get?",
    "answer": "70, 20 divided by 1/2 (.5) + 30 = 70"
  },
  {
    "riddle": "What do Henry the Eighth and Kermit the Frog have in common?",
    "answer": "The same middle name."
  },
  {
    "riddle": "What side of a cat has the most fur?",
    "answer": "The outside."
  },
  {
    "riddle": "What three letters change a girl into a woman?",
    "answer": "Age"
  },
  {
    "riddle": "What word when read from left to right is a ruler but when read right to left is a servant?",
    "answer": "God"
  },
  {
    "riddle": "Be quick and say the first thing that comes to your head. What do cows drink?",
    "answer": "Cows drink water not milk. Only calves drink milk."
  },
  {
    "riddle": "There are 8 men on a couch, three legs break and 6 men leave. How many legs are there?",
    "answer": "Five, one from the couch and four from the men."
  },
  {
    "riddle": "A Jewish man living in the United States cannot be buried on church grounds even if he converts to Christianity.  Why not?",
    "answer": "You can’t bury the living."
  },
  {
    "riddle": "How could all of your cousins have an aunt who is not your aunt?",
    "answer": "Their aunt is your mother."
  },
  {
    "riddle": "Who was the president of the USA before John F. Kennedy was assassinated?",
    "answer": "John F. Kennedy."
  },
  {
    "riddle": "It is a Sunday morning and a man comes to find his wife dead. The maid said she was cleaning the kitchen, the mailman said he was delivering mail, the nanny said he was teaching the kids, and the farmer said he was harvesting his crops. Who done it?",
    "answer": "The mailman did it because the mail does not come on Sunday."
  },
  {
    "riddle": "What is the Easter bunny’s favorite kind of music?",
    "answer": "Hip hop"
  },
  {
    "riddle": "What question can you ask where you can get different answers every time but  all the answers being correct?",
    "answer": "What time is it?"
  },
  {
    "riddle": "You walk a mile south, a mile east and then a mile north. You end up in exact same spot you started. Where are you?",
    "answer": "The North Pole."
  },
  {
    "riddle": "Everyone is attracted to me and everybody falls for me. What am I?",
    "answer": "Gravity"
  },
  {
    "riddle": "What must you give before you can keep it?",
    "answer": "Your word."
  },
  {
    "riddle": "What do people spend a lot of money on every year but never want to use?",
    "answer": "Insurance"
  },
  {
    "riddle": "What did the pig say when the farmer caught him by the tail?",
    "answer": "That is the end of me."
  },
  {
    "riddle": "How can you take away 1 from 19 and the result would be the number 20?",
    "answer": "When it is the Roman numeral XIX. You take away “I” leaving “XX” which is 20."
  },
  {
    "riddle": "If there is a boat full of people how is there not a single person on board?",
    "answer": "Everyone on the boat is married."
  },
  {
    "riddle": "What’s the difference between a politician and a flying pig?",
    "answer": "The letter “F”."
  },
  {
    "riddle": "What can you add to the number one to make it disappear?",
    "answer": "Add the letter “G” and it’s gone."
  },
  {
    "riddle": "Which berry makes a harsh noise?",
    "answer": "Raspberry"
  },
  {
    "riddle": "I am the son of your grandmother and grandfather but not your uncle. Who am I?",
    "answer": "Your Dad."
  },
  {
    "riddle": "What is something you can give away as many times you want without ever losing it?",
    "answer": "Your name."
  },
  {
    "riddle": "A doctor and a bus driver are both in love the same woman. The bus driver had to take a trip for a week. Before leaving he gave the woman seven apples. Why?",
    "answer": "An apple a day keeps the doctor away!"
  },
  {
    "riddle": "What do you get when you mix lemons with gun powder?",
    "answer": "Lemonades"
  },
  {
    "riddle": "What man can shave 10 times a day and still have a beard?",
    "answer": "A barber."
  },
  {
    "riddle": "What is the next letter in this sequence: JFMAMJJASON_ ?",
    "answer": "The letter D. The sequence contains the first letter of each month."
  },
  {
    "riddle": "Which word contains all 26 letters?",
    "answer": "Alphabet"
  },
  {
    "riddle": "If you tell me the truth I will kill you with my sword, if you tell me a lie I will kill you with my spell. What must you say to survive?",
    "answer": "You will kill me with your spell."
  },
  {
    "riddle": "What three number result in the same answer whether they are added together or multiplied?",
    "answer": "1, 2, & 3. (1+2+3=6 1x2x3=6)"
  },
  {
    "riddle": "When the day after tomorrow is yesterday, today will be as far from Wednesday as today was from Wednesday when the day before yesterday was tomorrow. What is the day after this day?",
    "answer": "Thursday"
  },
  {
    "riddle": "Twelve pears hanging high, twelve men passing by. Each took a pear and left eleven hanging there. How can this be?",
    "answer": "Each was the mans name."
  },
  {
    "riddle": "It is there from the very start and will be there until the end. To end you must cross over and you must pass through it to begin.",
    "answer": "A starting line"
  },
  {
    "riddle": "What two letters in the alphabet say goodbye?",
    "answer": "CU"
  },
  {
    "riddle": "What starts with a T ends with a T and is full of T?",
    "answer": "Teapot"
  },
  {
    "riddle": "A man was cleaning the windows of a four story building. He slipped and fell off the ladder, but wasn’t hurt. How is that possible?",
    "answer": "He fell from the first step of the ladder."
  },
  {
    "riddle": "What turns everything around but does not move?",
    "answer": "A mirror"
  },
  {
    "riddle": "I touch the Earth, I touch the sky, but if I touch you, you’ll likely die. What am I?",
    "answer": "Lightning"
  },
  {
    "riddle": "What is big and yellow and comes in the morning to brighten mom’s day?",
    "answer": "The school bus"
  },
  {
    "riddle": "What do you throw out when you want to use it, but take in when you don’t want to use it?",
    "answer": "An anchor"
  },
  {
    "riddle": "Take away my first letter and I sound the same. Take away my last letter, I still sound the same. Take away my letter in the middle, I will still sound the same. I am a 5 letter word. What am I?",
    "answer": "Empty"
  },
  {
    "riddle": "You use a knife to slice my head and weep beside me when I am dead. What am I?",
    "answer": "An onion"
  },
  {
    "riddle": "I am always in front of you but yet I am never here. What am I?",
    "answer": "The future"
  },
  {
    "riddle": "I know a word of letters three. Add two and fewer there will be. What is the word?",
    "answer": "Few"
  },
  {
    "riddle": "Where does the Easter bunny like to eat breakfast?",
    "answer": "IHOP"
  },
  {
    "riddle": "What do frogs order when they go to a restaurant?",
    "answer": "French Flies"
  },
  {
    "riddle": "If a cat can jump 5 feet high, then why can’t it jump through a window that is 3 feet high?",
    "answer": "Because the window is closed."
  },
  {
    "riddle": "A ship is filled with people yet there is not a single person on board. How can that be?",
    "answer": "Everyone on board was married."
  },
  {
    "riddle": "Why did the girl throw a stick of butter out of her window?",
    "answer": "Because she wanted to see a butterfly."
  },
  {
    "riddle": "Five men went into a church in the pouring rain.  None of the men had an umbrella but one man did not get wet.  How is that possible?",
    "answer": "He was in the casket."
  },
  {
    "riddle": "What does everyone know how to open but not how to close?",
    "answer": "An egg"
  },
  {
    "riddle": "What has wheels and flies but is not an aircraft?",
    "answer": "A garbage truck."
  },
  {
    "riddle": "You use it between your head and your toes, the more it works the thinner it grows. What is it?",
    "answer": "A bar of soap."
  },
  {
    "riddle": "What is put on a table, cut, but never eaten?",
    "answer": "A deck of cards."
  },
  {
    "riddle": "Two men are playing chess.  They play five games.  Each man wins three games.  How is that possible?",
    "answer": "They were not playing each other."
  },
  {
    "riddle": "I run but cannot walk, sometimes sing but never talk. What am I?",
    "answer": "A clock"
  },
  {
    "riddle": "What can you hold but not touch and release without throwing?",
    "answer": "Your breath"
  },
  {
    "riddle": "What jumps when it walks but sits when it stands?",
    "answer": "A kangaroo"
  },
  {
    "riddle": "A bus driver goes the wrong way on a one way street. He passes the cops but they don’t stop him. Why?",
    "answer": "He was walking"
  },
  {
    "riddle": "What can fly without wings?",
    "answer": "Time"
  },
  {
    "riddle": "My seas have no water, my mountains have no rock, and my land has no grass. what am I?",
    "answer": "A map"
  },
  {
    "riddle": "What do you do if your golden retriever gets sick?",
    "answer": "Call the dogtor"
  },
  {
    "riddle": "What has a bottom at the top?",
    "answer": "A leg"
  },
  {
    "riddle": "What did the baby corn say to its mother?",
    "answer": "Where’s pop corn?"
  },
  {
    "riddle": "Why does Santa like bears?",
    "answer": "Because they have clause"
  },
  {
    "riddle": "I start with “e” end with “e”. I have whole countries inside me. What am I?",
    "answer": "Europe"
  },
  {
    "riddle": "A farmer has a wolf, a chicken, and a bag of grain he needs to get accross a river. He has one boat to take them all across. He can only take one at a time.  He cant leave the wolf alone with chicken or the chicken alone with grain. How does he do it?",
    "answer": "He takes chicken first.  He takes the wolf over second and comes back with the chicken. He drops of the chicken and takes the grain to the other side with the wolf. Last he goes back to get the chicken and brings him across."
  },
  {
    "riddle": "I am needed in life but not in death.  You can’t have fun without me.  What am I?",
    "answer": "The letter F"
  },
  {
    "riddle": "Why was the football coach upset with the candy machine?",
    "answer": "He wanted his quarter back"
  },
  {
    "riddle": "Sometimes I am light, sometimes I am dark.  Most people like me.  What am I?",
    "answer": "Chocolate"
  },
  {
    "riddle": "A barrel of water weighs 75 pounds.  What must you add to it to make it weigh 60 pounds?",
    "answer": "Holes"
  },
  {
    "riddle": "What is the sun’s favorite day of the week?",
    "answer": "Sunday"
  },
  {
    "riddle": "A man shot his wife, soaked her in acid, then 10 minutes later took her out to dinner.  How did he do it?",
    "answer": "The man shot a picture of his wife then developed it"
  },
  {
    "riddle": "What has thousands of ribs and two backbones?",
    "answer": "Train tracks"
  },
  {
    "riddle": "A boy and his father are in a car crash. The father dies and the boy is rushed to the hospital.  They surgeon see’s the boy and says I cannot operate on him, he is my son.  Who is the surgeon?",
    "answer": "The boy’s mother"
  },
  {
    "riddle": "I have two hands, but cannot hold. I have no mouth, but the unknown can still be told. What am I?",
    "answer": "A clock"
  },
  {
    "riddle": "A man purchased a $10,000 car but he didn’t have to pay a penny.  How did he do it?",
    "answer": "He didn’t have to pay a penny, he had to pay $10,000"
  },
  {
    "riddle": "What color can you eat?",
    "answer": "Orange"
  },
  {
    "riddle": "What has no lid, hinges or key, yet golden treasure can be found inside?",
    "answer": "An egg"
  },
  {
    "riddle": "What is in seasons, seconds, centuries and minutes but not in decades, years or days?",
    "answer": "The Letter “n”"
  },
  {
    "riddle": "What has a tongue but does not eat or speak?",
    "answer": "A shoe"
  },
  {
    "riddle": "Where do polar bears go to vote?",
    "answer": "The North Poll"
  },
  {
    "riddle": "I never speak unless spoken to, many have heard me but none have seen me. What am I?",
    "answer": "An echo"
  },
  {
    "riddle": "An archaeologist digs up two perfectly preserved bodies. He immediately identifies them as Adam and Eve. How can he tell they are Adam and Eve?",
    "answer": "They had no belly buttons"
  },
  {
    "riddle": "What can fill an entire room without taking up any space?",
    "answer": "Light"
  },
  {
    "riddle": "What is black and white and has wheels?",
    "answer": "A zebra wearing roller skates"
  },
  {
    "riddle": "When can you add 2 to 11 and get 1 as the answer?",
    "answer": "When you add 2 to 11 o’clock you get 1 o’clock"
  },
  {
    "riddle": "What walks on its head all day?",
    "answer": "A nail in a horseshoe"
  },
  {
    "riddle": "A square house is being circled by a large bear.  All of the walls of the house face South.  What color is the bear?",
    "answer": "White because it is a polar bear"
  },
  {
    "riddle": "What do you call a dozen rabbits in a row walking backward?",
    "answer": "A receding hair line"
  },
  {
    "riddle": "What is weightless but takes two people to hold it?",
    "answer": "Friendship"
  },
  {
    "riddle": "How many animals of each species did Moses take on the ark with him?",
    "answer": "None, Moses was not on the Ark, Noah was"
  },
  {
    "riddle": "If you look in water you might see me yet I never get wet.  What am I?",
    "answer": "A reflection"
  },
  {
    "riddle": "Why are teddy bears never hungry?",
    "answer": "Because they are always stuffed"
  },
  {
    "riddle": "You can touch me but you probably wouldn’t want to.  I can see you but you can’t see me.  What am I?",
    "answer": "Your eyes"
  },
  {
    "riddle": "What do islands and the letter “T” have in common?",
    "answer": "They are both in the middle of water"
  },
  {
    "riddle": "When does an Irish potato change its nationality?",
    "answer": "When it becomes French fries"
  },
  {
    "riddle": "If an electric train is going West at 90 miles per hour and there is a strong Easterly wind, which way does the smoke from the train drift?",
    "answer": "Electric strains don’t make smoke"
  },
  {
    "riddle": "At night they come without being fetched. By day they are lost without being stolen. What are they?",
    "answer": "Stars"
  },
  {
    "riddle": "The last man on Earth received a phone call, who was the caller?",
    "answer": "A woman"
  },
  {
    "riddle": "Where do salads try on clothes?",
    "answer": "The dressing room"
  },
  {
    "riddle": "I am the only organ in the human body that gave itself it’s own name. What am I?",
    "answer": "The brain"
  },
  {
    "riddle": "Which word in the dictionary is spelled incorrectly?",
    "answer": "Incorrectly"
  },
  {
    "riddle": "What are the strongest days of the week?",
    "answer": "Saturday & Sunday, the rest are weekdays"
  },
  {
    "riddle": "I no longer have eyes, but once I did see. Once I had thoughts, but now I’m white and empty. What am I?",
    "answer": "A skull"
  },
  {
    "riddle": "Why do communists write everything in lower case?",
    "answer": "Because they hate capitalism"
  },
  {
    "riddle": "Why don’t cows get sick very often?",
    "answer": "Because they have natural imoonity"
  },
  {
    "riddle": "You answer me, but I never ask you a question. What am I?",
    "answer": "The telephone"
  },
  {
    "riddle": "Walk on the living, they don’t even mumble. Walk on the dead, they mutter and grumble. What are they?",
    "answer": "Leaves"
  },
  {
    "riddle": "What is it called when Batman skips church?",
    "answer": "Christian Bale"
  },
  {
    "riddle": "Forwards it’s heavy, but backwards it’s not.",
    "answer": "Ton"
  },
  {
    "riddle": "Say my name and I am no more.",
    "answer": "Silence"
  },
  {
    "riddle": "What does an angel use to start a fire?",
    "answer": "A match made in heaven"
  },
  {
    "riddle": "How do you make the number one disappear by adding something to it?",
    "answer": "Ad the letter “g” to “one” and it is gone"
  },
  {
    "riddle": "What can be larger than you without weighing anything?",
    "answer": "Your shadow"
  },
  {
    "riddle": "It belongs to you but you don’t use it.  It does not belong to other people but they use it.  What is it?",
    "answer": "Your phone number"
  },
  {
    "riddle": "What did the panda bear get when it fell out of the tree?",
    "answer": "Bamboo boos"
  },
  {
    "riddle": "What building has the most stories?",
    "answer": "The library"
  },
  {
    "riddle": "What is something you will never see again?",
    "answer": "Yesterday"
  },
  {
    "riddle": "What do Eskimos get from sitting on the ice for way too long?",
    "answer": "Polaroids"
  },
  {
    "riddle": "If you jump off a two story building where do you land?",
    "answer": "In the hospital"
  },
  {
    "riddle": "What can you hold in your right hand but never in your left hand?",
    "answer": "Your left hand"
  },
  {
    "riddle": "What do you call a boomerang that doesn’t work?",
    "answer": "A stick"
  },
  {
    "riddle": "What English word sounds the same even after you take away four of its five letters?",
    "answer": "Queue"
  },
  {
    "riddle": "You can easily touch me but not see me.  You can throw me out but never away. What am I?",
    "answer": "Your back"
  },
  {
    "riddle": "If lightning strikes an orchestra who is the one most likely to get hit?",
    "answer": "The conductor"
  },
  {
    "riddle": "Why do cows have hooves instead of feet?",
    "answer": "Because they lactose"
  },
  {
    "riddle": "What does an orange do when it takes a rest?",
    "answer": "Concentrates"
  },
  {
    "riddle": "What is the difference between a school boy studying and a farmer watching his cattle?",
    "answer": "One stocks his mind the other minds his stock"
  },
  {
    "riddle": "You can’t keep this without giving it first?",
    "answer": "A promise"
  },
  {
    "riddle": "How can a person go eight days without sleep?",
    "answer": "The person sleeps at night"
  },
  {
    "riddle": "What is a kangaroo’s favorite year?",
    "answer": "Leap year"
  },
  {
    "riddle": "What is the easiest way to keep water from running?",
    "answer": "Don’t pay the bill"
  },
  {
    "riddle": "Why did the woman take an elephant to the airport instead of a taxi?",
    "answer": "The elephant had a bigger trunk"
  },
  {
    "riddle": "What has no beginning, end or middle?",
    "answer": "A doughnut"
  },
  {
    "riddle": "Why was the math book always so depressed?",
    "answer": "Because it had so many unsolved problems"
  },
  {
    "riddle": "What was the first man made invention that could see through a wall?",
    "answer": "A window"
  },
  {
    "riddle": "How many eggs can you put into an empty basket?",
    "answer": "One, then it will no longer be empty"
  },
  {
    "riddle": "Why did the lemon disapprove of his daughter?",
    "answer": "Because she was a little tart"
  },
  {
    "riddle": "What’s the last thing that goes through a bug’s mind as it hits the windshield?",
    "answer": "His butt"
  },
  {
    "riddle": "What do you call a bear with no teeth?",
    "answer": "A gummy bear"
  },
  {
    "riddle": "A man leaves home and turns left three times.  When he returns home he finds two men wearing masks. Who are the two men?",
    "answer": "The umpire and catcher"
  },
  {
    "riddle": "What is black when you buy it, red when you use it, and gray when you throw it away?",
    "answer": "Charcoal"
  },
  {
    "riddle": "What has a head but never weeps, has a bed but never sleeps, can run but never walks, and has banks but no money?",
    "answer": "A river"
  },
  {
    "riddle": "Thirty-two white horses on a red hill. When you talk, they move. When you’re silent, they stand still. They can be lost, but replaced only once.",
    "answer": "Teeth"
  },
  {
    "riddle": "If the Vice President of the United States dies, who becomes President?",
    "answer": "The President didn’t die, so he or she is still President"
  },
  {
    "riddle": "Without me you will surely die.  Too much of me and like a pig you may lie.  What am I?",
    "answer": "Food"
  },
  {
    "riddle": "Every night and every morning I am told what to do and I do it, yet everyone is still mad at me? What am I?",
    "answer": "An alarm clock"
  },
  {
    "riddle": "What has four fingers and a thumb but is not alive?",
    "answer": "A  glove"
  },
  {
    "riddle": "You can always find me in the past. I am created in the present, but the future can not change me.  What am I?",
    "answer": "History"
  },
  {
    "riddle": "What goes up and down but never moves?",
    "answer": "Stairs"
  },
  {
    "riddle": "What do you find in the middle of Paris?",
    "answer": "The letter “R”"
  },
  {
    "riddle": "What’s in a man’s pants that you won’t find in a girl’s dress?",
    "answer": "Pockets"
  },
  {
    "riddle": "What time is it when the clock strikes 13?",
    "answer": "Time to get the clock fixed"
  },
  {
    "riddle": "What does a vegetarian zombie eat?",
    "answer": "Graaains"
  },
  {
    "riddle": "What has six faces, but never wears makeup? It also has twenty-one eyes, but cannot see.",
    "answer": "A die from a set of dice"
  },
  {
    "riddle": "What did the big candle say to the little candle?",
    "answer": "I’m going out tonight"
  },
  {
    "riddle": "What has been around for millions of years but is never more than a month old?",
    "answer": "The moon"
  },
  {
    "riddle": "What is the easiest way to double your money?",
    "answer": "Use a mirror"
  },
  {
    "riddle": "If 3 salesmen can sell three cars in seven minutes, how many cars can six salesmen sell in seventy minutes?",
    "answer": "60 cars"
  },
  {
    "riddle": "What is the saddest fruit in the world?",
    "answer": "Blueberry"
  },
  {
    "riddle": "What 3 digit number will give you the same answer whether you subtract 5 or divide by 5?",
    "answer": "6.25"
  },
  {
    "riddle": "A hobo can make a new cigarette from 4 cigarette buts.  If the hobo finds 16 cigarette butts, how many cigarettes can he make?",
    "answer": "5, four from the original 16 butts and one more from the butts of those cigarettes when he smokes them"
  },
  {
    "riddle": "Where do fish keep their money?",
    "answer": "The riverbank"
  },
  {
    "riddle": "What are four days of the week that begin with the letter “T”?",
    "answer": "Tuesday, Thursday, Today, Tomorrow"
  },
  {
    "riddle": "Joe has been hired to paint the numbers 1 through 100 on 100 apartments. How many times will he paint the number 8?",
    "answer": "Twenty"
  },
  {
    "riddle": "What has feet and legs, but nothing else?",
    "answer": "Pantyhose"
  },
  {
    "riddle": "Your mother’s brother’s only brother-in-law is asleep on your couch. Who is asleep on your couch?",
    "answer": "You’re father"
  },
  {
    "riddle": "What grows up while growing down?",
    "answer": "A goose"
  },
  {
    "riddle": "What is harder to catch the faster you run?",
    "answer": "Your breath"
  },
  {
    "riddle": "What coin doubles in value when half is deducted?",
    "answer": "Half dollar"
  },
  {
    "riddle": "What did one wall say to the other?",
    "answer": "I’ll meet you at the corner."
  },
  {
    "riddle": "What walks on four feet in the morning, two in the afternoon and three at night?",
    "answer": "Man"
  },
  {
    "riddle": "Before Mt. Everest was discovered, what was the highest mountain in the world?",
    "answer": "Mt. Everest"
  },
  {
    "riddle": "What has no beginning, end, or middle?",
    "answer": "A donut"
  },
  {
    "riddle": "Mary’s mother had three duaghters. The first was named April and the second was named May. What was the name of the third daughter?",
    "answer": "Mary"
  },
  {
    "riddle": "Mr. Smith has 4 daughters. Each of his daughters has a brother.  How many children does Mr. Smith have?",
    "answer": "Five"
  },
  {
    "riddle": "What connects two people but only touches one?",
    "answer": "A wedding ring"
  },
  {
    "riddle": "What always goes to bed with its shoes on?",
    "answer": "A horse"
  },
  {
    "riddle": "What is the center of gravity?",
    "answer": "V"
  },
  {
    "riddle": "What man has married many women but has always been single?",
    "answer": "A priest"
  },
  {
    "riddle": "What always murmurs but never talks. Always runs but never walks. Has a bed but never sleeps. Has a mouth but never speaks.",
    "answer": "A river"
  },
  {
    "riddle": "What can one not keep, two hold, and three destroy?",
    "answer": "A secret"
  },
  {
    "riddle": "Why is 6 afraid of 7?",
    "answer": "Because 7 ate 9"
  },
  {
    "riddle": "Who gets paid when they drive away their customers?",
    "answer": "Taxi drivers"
  },
  {
    "riddle": "What table you can eat?",
    "answer": "Vegetable"
  },
  {
    "riddle": "Where should you put a noisy dog?",
    "answer": "In a barking lot"
  },
  {
    "riddle": "What six letter word when you take away one letter leaves twelve?",
    "answer": "Dozens"
  },
  {
    "riddle": "My age today is three times what it will be three years from now minus three times what my age was three years ago. How old am I?",
    "answer": "18"
  },
  {
    "riddle": "The rungs of a 10 foot ladder attached to a ship are 1 foot apart. If the water is rising at the rate of two foot an hour, how long will it take until the water covers over the ladder?",
    "answer": "Never, the ladder rises with the ship"
  },
  {
    "riddle": "If an airplane crashed exactly on the border of the United States and Canada, where would the survivors be buried?",
    "answer": "You don’t bury survivors"
  },
  {
    "riddle": "How much dirt is there in a hole that is 3 ft deep, and 9 inches in diameter?",
    "answer": "None, it is a hole"
  },
  {
    "riddle": "How far can you run into the woods?",
    "answer": "Half way, then you will be running out"
  },
  {
    "riddle": "What can go up a chimney down but can’t go down a chimney up?",
    "answer": "An umbrella"
  },
  {
    "riddle": "Imagine you are in a room with no doors or windows, how do you get out?",
    "answer": "Stop imagining"
  },
  {
    "riddle": "What seven letter word has hundreds of letters in it?",
    "answer": "Mailbox"
  },
  {
    "riddle": "A doctor gives you 5 pills and tells you to take one every 30 minutes.  How long will it take you to finish the pills if you follow the doctors orders?",
    "answer": "2 Hours"
  },
  {
    "riddle": "You can hold it without seeing or touching it. What is that?",
    "answer": "Your breath"
  },
  {
    "riddle": "What can you add to a wooden box to make it lighter?",
    "answer": "Holes"
  },
  {
    "riddle": "The 22nd and the 24th President of the United States of America were born from the same father and the same mother.  However, they were not brothers. How could that be?",
    "answer": "They were the same person"
  },
  {
    "riddle": "How many apples grow on a tree?",
    "answer": "All apples grow on trees"
  },
  {
    "riddle": "You have a dime and a dollar. You buy a dog and a collar.  The dog costs one dollar more than the collar.  How much is the collar?",
    "answer": "5 cents"
  },
  {
    "riddle": "I am always on my way, but never arrive today. What am I?",
    "answer": "Tomorrow"
  },
  {
    "riddle": "I am not alive but I can die.  What am I?",
    "answer": "A battery"
  },
  {
    "riddle": "I don’t have eyes, ears, nose or a tongue, but I can see, smell, hear and taste everything. What am I?",
    "answer": "A brain"
  },
  {
    "riddle": "What is the most slippery country in the world?",
    "answer": "Greece"
  },
  {
    "riddle": "Which month has 28 days?",
    "answer": "All months"
  },
  {
    "riddle": "What gets whiter the dirtier it gets?",
    "answer": "A chalkboard"
  },
  {
    "riddle": "A butcher is 6 feet tall and wears size 12 shoes.  What does he weigh?",
    "answer": "Meat"
  },
  {
    "riddle": "What is full of holes but can still hold water?",
    "answer": "A sponge"
  },
  {
    "riddle": "What’s a lifeguard’s favorite game?",
    "answer": "Pool"
  },
  {
    "riddle": "Why did the doctor switch jobs?",
    "answer": "He lost his patients"
  },
  {
    "riddle": "The person who makes it, has no need of it. The person who buys it, has no use for it. The person who uses it can neither see nor feel it. What is it?",
    "answer": "A coffin"
  },
  {
    "riddle": "Where were English kings usually crowned?",
    "answer": "On their heads"
  },
  {
    "riddle": "A sundial is the timepiece with the least amount of moving parts.  What is the timepiece with the greatest amount of moving parts?",
    "answer": "An hourglass"
  },
  {
    "riddle": "What dress does everyone have, but no one wears?",
    "answer": "An address"
  },
  {
    "riddle": "Which side of a turkey has the most feathers?",
    "answer": "The outside"
  },
  {
    "riddle": "What do you answer that never asks a question?",
    "answer": "A telephone"
  },
  {
    "riddle": "What eight letter word contains all of the twenty six letters?",
    "answer": "Alphabet"
  },
  {
    "riddle": "If you drop a yellow hat in the Red Sea, what does it become?",
    "answer": "Wet"
  },
  {
    "riddle": "A cyclist in a cross-country race, just before the crossing finish line overtakes the person in second place. What place did the cyclist finish in?",
    "answer": "Second"
  },
  {
    "riddle": "The more I appear The less you see. So riddle me this: What could I be?",
    "answer": "Darkness"
  },
  {
    "riddle": "Why did the hamburger go to the gym?",
    "answer": "It wanted better buns"
  },
  {
    "riddle": "I am easy to get into but hard to get out of.  What am I?",
    "answer": "Trouble"
  },
  {
    "riddle": "What belongs to you but other people use it more than you do?",
    "answer": "Your name"
  },
  {
    "riddle": "What has a neck but no head?",
    "answer": "A bottle"
  },
  {
    "riddle": "What instrument can you hear but never see?",
    "answer": "Your voice"
  },
  {
    "riddle": "The more it dries, the wetter it becomes. What is it?",
    "answer": "A towel"
  },
  {
    "riddle": "How many of each animal did Moses take on the ark with him?",
    "answer": "None, Moses was not on the ark"
  },
  {
    "riddle": "What do you call a rabbit with fleas?",
    "answer": "Bugs Bunny"
  },
  {
    "riddle": "What can be broke without touching it?",
    "answer": "A promise"
  },
  {
    "riddle": "What goes up and never comes back down?",
    "answer": "Your age"
  },
  {
    "riddle": "What has to be broken before you can use it?",
    "answer": "An egg"
  },
  {
    "riddle": "What word is always pronounced wrong?",
    "answer": "Wrong"
  },
  {
    "riddle": "Which weighs more, a pound of feathers or a pound of bricks?",
    "answer": "They weigh the same"
  },
  {
    "riddle": "What has one eye but cannot see?",
    "answer": "A needle"
  },
  {
    "riddle": "What kind of tree can you carry in your hand?",
    "answer": "A palm"
  },
  {
    "riddle": "What has 3 feet but cannot walk?",
    "answer": "A yardstick"
  },
  {
    "riddle": "What has hands but cannot clap?",
    "answer": "A clock"
  },
  {
    "riddle": "What has 4 eyes but can’t see?",
    "answer": "Mississippi"
  },
  {
    "riddle": "What’s orange and sounds like a parrot?",
    "answer": "A carrot"
  },
  {
    "riddle": "What occurs once in a minute, twice in a moment and never in one thousand years?",
    "answer": "The letter “m”"
  },
  {
    "riddle": "What kind of room has no doors or windows?",
    "answer": "A mushroom"
  },
  {
    "riddle": "What goes up when rain comes down?",
    "answer": "Umbrellas"
  },
  {
    "riddle": "What loses its head in the morning and gets it back at night?",
    "answer": "A pillow"
  },
  {
    "riddle": "What kind of dog keeps the best time?",
    "answer": "A Watchdog"
  },
  {
    "riddle": "What do you call bodyguards in front of a Samsung store?",
    "answer": "Guardians of the Galaxy"
  },
  {
    "riddle": "A farmer has 10 cows, all but six die, how many are left?",
    "answer": "Six"
  },
  {
    "riddle": "What number do you get when you multiply all of the numbers on a telephone’s dial pad?",
    "answer": "Zero"
  },
  {
    "riddle": "What disappears the instant you say its name?",
    "answer": "Silence"
  },
  {
    "riddle": "You throw away the outside then eat the inside.  Then you throw away the outside and eat the inside.  What is it?",
    "answer": "An ear of corn"
  },
  {
    "riddle": "What asks but never answers?",
    "answer": "An Owl"
  },
  {
    "riddle": "I am tall when young but short when old? What am I?",
    "answer": "A candle"
  },
  {
    "riddle": "What is brown and sticky?",
    "answer": "A stick"
  },
  {
    "riddle": "What can you catch but can not throw?",
    "answer": "A cold"
  },
  {
    "riddle": "What three numbers give the same answer when multiplied together or added together?",
    "answer": "1, 2 and 3"
  },
  {
    "riddle": "I travel all over the world, but always stay in my corner. What am I?",
    "answer": "A stamp"
  },
  {
    "riddle": "What has a foot but no legs?",
    "answer": "A snail"
  },
  {
    "riddle": "Poor people have it. Rich people need it. If you eat it you die. What is it?",
    "answer": "Nothing"
  },
  {
    "riddle": "What has a head and a tail, but no body?",
    "answer": "A coin"
  },
  {
    "riddle": "What two things can you never eat for breakfast?",
    "answer": "Lunch & Dinner"
  },
  {
    "riddle": "The more you take, the more you leave behind. What are they?",
    "answer": "Footsteps"
  },
  {
    "riddle": "What tastes better than it smells?",
    "answer": "A Tongue"
  },
  {
    "riddle": "What word becomes shorter when you add two letters to it?",
    "answer": "Short"
  },
  {
    "riddle": "If I drink, I die. If i eat, I am fine. What am I?",
    "answer": "Fire"
  }
]
